Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_audio_codec_type.h
#ifndef _RTL8735B_AUDIO_CODEC_TYPE_H_
#define _RTL8735B_AUDIO_CODEC_TYPE_H_

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_00H
 * @brief  index_00h                                 (@ 0X000)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_HPO_CLPDPL                 15
#define AUDIO_CODEC_BIT_HPO_CLPDPL                   ((u32)0x00000001 << 15)                             /*!<R/W 0  Headphone left channel capless positive depop mode control (0: no depop, 1: depop) */
#define AUDIO_CODEC_SHIFT_HPO_CLNDPL                 13
#define AUDIO_CODEC_BIT_HPO_CLNDPL                   ((u32)0x00000001 << 13)                             /*!<R/W 0  Headphone left channel capless negative depop mode control (0: no depop, 1: depop) */
#define AUDIO_CODEC_SHIFT_HPO_CLL                    12
#define AUDIO_CODEC_BIT_HPO_CLL                      ((u32)0x00000001 << 12)                             /*!<R/W 0  Headphone left channel capless mode control (0: non-capless, 1: capless) */
#define AUDIO_CODEC_SHIFT_DTSDM_POW_L                10
#define AUDIO_CODEC_BIT_DTSDM_POW_L                  ((u32)0x00000001 << 10)                             /*!<R/W 0  Left channel ADC power on control: 0: power down 1: power on */
#define AUDIO_CODEC_SHIFT_DTSDM_CKXEN                9
#define AUDIO_CODEC_BIT_DTSDM_CKXEN                  ((u32)0x00000001 << 9)                              /*!<R/W 1  ADC integrater 1 OP chopper enable: 0 : disable 1 : enable (default) */
#define AUDIO_CODEC_SHIFT_DPRAMP_POW                 8
#define AUDIO_CODEC_BIT_DPRAMP_POW                   ((u32)0x00000001 << 8)                              /*!<R/W 0  DPRAMP power down control (0: power down, 1: power on) */
#define AUDIO_CODEC_SHIFT_DPRAMP_ENRAMP              7
#define AUDIO_CODEC_BIT_DPRAMP_ENRAMP                ((u32)0x00000001 << 7)                              /*!<R/W 0  DPRAMP enable ramp control (0: disable, 1: enable) */
#define AUDIO_CODEC_SHIFT_DPRAMP_CSEL                5
#define AUDIO_CODEC_MASK_DPRAMP_CSEL                 ((u32)0x00000003 << 5)                              /*!<R/W 11  Depop C size selection (00: 1x, 01: 2x, 10: 3x, 11: 4x) */
#define AUDIO_CODEC_SHIFT_DAC_L_POW                  3
#define AUDIO_CODEC_BIT_DAC_L_POW                    ((u32)0x00000001 << 3)                              /*!<R/W 0  DAC left channel power down control (0: power down, 1: power on) */
#define AUDIO_CODEC_SHIFT_DAC_CKXSEL                 2
#define AUDIO_CODEC_BIT_DAC_CKXSEL                   ((u32)0x00000001 << 2)                              /*!<R/W 0  DAC chopper clock selection (0: ckx2/4, 1: ckx2/8) */
#define AUDIO_CODEC_SHIFT_DAC_CKXEN                  1
#define AUDIO_CODEC_BIT_DAC_CKXEN                    ((u32)0x00000001 << 1)                              /*!<R/W 1  DAC chopper clock enable control (0: disable, 1: enable) */
#define AUDIO_CODEC_SHIFT_DAC_ADDACK_POW             0
#define AUDIO_CODEC_BIT_DAC_ADDACK_POW               ((u32)0x00000001 << 0)                              /*!<R/W 0  AD/DA clock power down control (0: power down, 1: power on) */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_01H
 * @brief  index_01h                                 (@ 0X002)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_HPO_OPPDPL                 15
#define AUDIO_CODEC_BIT_HPO_OPPDPL                   ((u32)0x00000001 << 15)                             /*!<R/W 0  Headphone left channel op positive depop mode control (0: no depop, 1: depop) */
#define AUDIO_CODEC_SHIFT_HPO_OPNDPL                 13
#define AUDIO_CODEC_BIT_HPO_OPNDPL                   ((u32)0x00000001 << 13)                             /*!<R/W 0  Headphone left channel op negative depop mode control (0: no depop, 1: depop) */
#define AUDIO_CODEC_SHIFT_HPO_MDPL                   11
#define AUDIO_CODEC_BIT_HPO_MDPL                     ((u32)0x00000001 << 11)                             /*!<R/W 0  Headphone left channel mute depop mode control (0: no depop, 1: depop) */
#define AUDIO_CODEC_SHIFT_HPO_L_POW                  10
#define AUDIO_CODEC_BIT_HPO_L_POW                    ((u32)0x00000001 << 10)                             /*!<R/W 0  Headphone left channel power down control (0: power down, 1: power on) */
#define AUDIO_CODEC_SHIFT_HPO_ENDPL                  8
#define AUDIO_CODEC_BIT_HPO_ENDPL                    ((u32)0x00000001 << 8)                              /*!<R/W 1  Headphone left channel enable depop control (0: disable, 1: enable) */
#define AUDIO_CODEC_SHIFT_HPO_ENAL                   6
#define AUDIO_CODEC_BIT_HPO_ENAL                     ((u32)0x00000001 << 6)                              /*!<R/W 1  Headphone left channel enable amplifier control (0: disable, 1: enable) */
#define AUDIO_CODEC_SHIFT_HPO_DPRSELL                2
#define AUDIO_CODEC_MASK_HPO_DPRSELL                 ((u32)0x00000003 << 2)                              /*!<R/W 11  Headphone left channel depop R size selection (00: 1x, 01: 2x, 10: 3x, 11: 4x) */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_02H
 * @brief  index_02h                                 (@ 0X004)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_VREF_POW                   15
#define AUDIO_CODEC_BIT_VREF_POW                     ((u32)0x00000001 << 15)                             /*!<R/W 0  VREF power control 0: power down 1: power on */
#define AUDIO_CODEC_SHIFT_MICBST_ENDFL               13
#define AUDIO_CODEC_BIT_MICBST_ENDFL                 ((u32)0x00000001 << 13)                             /*!<R/W 0  MICBST left channel enable differential 0:single to differential 1:differential to differential */
#define AUDIO_CODEC_SHIFT_MICBIAS_VSET               11
#define AUDIO_CODEC_MASK_MICBIAS_VSET                ((u32)0x00000003 << 11)                             /*!<R/W 0  MICBIAS select output voltage level 00:0.9*AVDD 01:0.86*AVDD (for AVDD=1.8v) 10:0.75*AVDD 11:reserved */
#define AUDIO_CODEC_SHIFT_MICBIAS_POW                10
#define AUDIO_CODEC_BIT_MICBIAS_POW                  ((u32)0x00000001 << 10)                             /*!<R/W 0  MICBIAS power control 0:power down 1:power on */
#define AUDIO_CODEC_SHIFT_MICBIAS_ENCHX              9
#define AUDIO_CODEC_BIT_MICBIAS_ENCHX                ((u32)0x00000001 << 9)                              /*!<R/W 1  MICBIAS enable chopper clock 0:disable 1:enable */
#define AUDIO_CODEC_SHIFT_MBIAS_POW                  8
#define AUDIO_CODEC_BIT_MBIAS_POW                    ((u32)0x00000001 << 8)                              /*!<R/W 0  MBIAS power control 0: power down 1: power on */
#define AUDIO_CODEC_SHIFT_HPO_SEL                    6
#define AUDIO_CODEC_BIT_HPO_SEL                      ((u32)0x00000001 << 6)                              /*!<R/W 1  Headphone left channel single-end mode control (0: differential, 1: single-end) */
#define AUDIO_CODEC_SHIFT_HPO_ML                     0
#define AUDIO_CODEC_MASK_HPO_ML                      ((u32)0x00000003 << 0)                              /*!<R/W 11  Headphone left channel mute control (0: un-mute, 1: mute), <0>: DAC, <1>: Analog in */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_03H
 * @brief  index_03h                                 (@ 0X006)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_HPO_GSELL                  12
#define AUDIO_CODEC_MASK_HPO_GSELL                   ((u32)0x00000003 << 12)                             /*!<R/W 0  invalid */
#define AUDIO_CODEC_SHIFT_VREF_VREFSEL               10
#define AUDIO_CODEC_MASK_VREF_VREFSEL                ((u32)0x00000003 << 10)                             /*!<R/W 10  VREF voltage selection 00: 0.52*VDD 01: 0.51*VDD 10: 0.50*VDD (default) 11: 0.49*VDD */
#define AUDIO_CODEC_SHIFT_MICBST_POW                 9
#define AUDIO_CODEC_BIT_MICBST_POW                   ((u32)0x00000001 << 9)                              /*!<R/W 0  MICBST power control pow<0>: right channel pow<1>: left channel 0:power down 1:power on */
#define AUDIO_CODEC_SHIFT_MICBST_MUTE_L              4
#define AUDIO_CODEC_MASK_MICBST_MUTE_L               ((u32)0x00000003 << 4)                              /*!<R/W 11  MICBST mute control mute<0>: mic in mute<1>: line in 0:unmute 1:mute */
#define AUDIO_CODEC_SHIFT_MICBST_GSELL               0
#define AUDIO_CODEC_MASK_MICBST_GSELL                ((u32)0x00000003 << 0)                              /*!<R/W 0  MICBST left channel gain select 00: 0dB 01:20dB 10:30dB 11:40dB */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_04H
 * @brief  index_04h                                 (@ 0X008)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_MICBIAS_POWSHDT            14
#define AUDIO_CODEC_BIT_MICBIAS_POWSHDT              ((u32)0x00000001 << 14)                             /*!<R/W 0  MICMIAS OCP power control 0: disable OCP 1: enable OCP */
#define AUDIO_CODEC_SHIFT_MICBIAS_OCSEL              12
#define AUDIO_CODEC_MASK_MICBIAS_OCSEL               ((u32)0x00000003 << 12)                             /*!<R/W 1  OCP current selection 00: 2.5mA 01: 5mA 10: 7.5mA 11: 10mA */
#define AUDIO_CODEC_SHIFT_MICBIAS_COUNT              8
#define AUDIO_CODEC_MASK_MICBIAS_COUNT               ((u32)0x0000000F << 8)                              /*!<R/W 1  when OCP happen disable time @312.5kHz 0000: 819.2us 0001: 1638.4us 0010: 3276.8us 0011: 6553.6us */
#define AUDIO_CODEC_SHIFT_REG_HPO_BIAS               6
#define AUDIO_CODEC_MASK_REG_HPO_BIAS                ((u32)0x00000003 << 6)                              /*!<R/W 0  HPO driving current control */
#define AUDIO_CODEC_SHIFT_DEBUG_BUS_SEL              0
#define AUDIO_CODEC_MASK_DEBUG_BUS_SEL               ((u32)0x0000001F << 0)                              /*!<R/W 0  2'b00: debug_bus_a; 2'b01: debug_bus_b; 2'b10: debug_bus_c; 2'b11: debug_bus_d; */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_0AH
 * @brief  index_0ah                                 (@ 0X014)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_LPF_RD               0
#define AUDIO_CODEC_MASK_ADC_L_LPF_RD                ((u32)0x0000FFFF << 0)                              /*!<R 0   LCH adc lpf out valus: format S(16,15) */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_0BH
 * @brief  index_0bh                                 (@ 0X016)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_LPF_RD               0
#define AUDIO_CODEC_MASK_ADC_R_LPF_RD                ((u32)0x0000FFFF << 0)                              /*!<R 0   RCH adc lpf out valus: format S(16,23) */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_0CH
 * @brief  index_0ch                                 (@ 0X018)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_CKX_MICBIAS_EN             4
#define AUDIO_CODEC_BIT_CKX_MICBIAS_EN               ((u32)0x00000001 << 4)                              /*!<R/W 0  1'b1: enable ckx_micbias to be 312.5KHz */
#define AUDIO_CODEC_SHIFT_BB_CK_DEPOP_EN             3
#define AUDIO_CODEC_BIT_BB_CK_DEPOP_EN               ((u32)0x00000001 << 3)                              /*!<R/W 0  1'b1: enable ck_depop  */
#define AUDIO_CODEC_SHIFT_MICBIAS_OC                 2
#define AUDIO_CODEC_BIT_MICBIAS_OC                   ((u32)0x00000001 << 2)                              /*!<R 0  the status flag of MICBIAS over-current protection */
#define AUDIO_CODEC_SHIFT_SEL_BB_CK_DEPOP            0
#define AUDIO_CODEC_MASK_SEL_BB_CK_DEPOP             ((u32)0x00000003 << 0)                              /*!<R/W 1  2'b00: ck_depop=40MHz/1024, 2'b01: ck_depop=40MHz/2048 2'b10: ck_depop=40MHz/4096, 2'b11: ck_depop=40MHz/8192 */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_0DH
 * @brief  index_0dh                                 (@ 0X01A)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ST_L_DS_EN                 6
#define AUDIO_CODEC_BIT_ST_L_DS_EN                   ((u32)0x00000001 << 6)                              /*!<R/W 0  sidetone L path clock enable after EQ : 0:disable 1:enable */
#define AUDIO_CODEC_SHIFT_ST_L_DS_MUTE_EN            5
#define AUDIO_CODEC_BIT_ST_L_DS_MUTE_EN              ((u32)0x00000001 << 5)                              /*!<R/W 1  sidetone L path mute enable after EQ : 0:disable 1:enable */
#define AUDIO_CODEC_SHIFT_SIDETON_L_IN_SEL           0
#define AUDIO_CODEC_MASK_SIDETON_L_IN_SEL            ((u32)0x00000003 << 0)                              /*!<R/W 0  sideton_l_in_sel[0] 1'b0 source from uplink channel L; 1'b1 source from uplink channel R */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_0EH
 * @brief  index_0eh                                 (@ 0X01C)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_SIDETONE_L_ZDET_FUNC       14
#define AUDIO_CODEC_MASK_SIDETONE_L_ZDET_FUNC        ((u32)0x00000003 << 14)                             /*!<R/W 0  2'b0:immediate change 2'b01: zero detection enable 2'b10: zero detection step change */
#define AUDIO_CODEC_SHIFT_SIDETONE_L_ZDET_TOUT       12
#define AUDIO_CODEC_MASK_SIDETONE_L_ZDET_TOUT        ((u32)0x00000003 << 12)                             /*!<R/W 0  After EQ(samples =fs ): 2'b00: 1024*16 samples 2'b01: 1024*32 samples 2'b10: 1024*64 samples 2'b11: 256 samples  */
#define AUDIO_CODEC_SHIFT_SIDETONE_L_BOOST_SEL       11
#define AUDIO_CODEC_BIT_SIDETONE_L_BOOST_SEL         ((u32)0x00000001 << 11)                             /*!<R/W 0  sidetone boost select 1'b1 : +12.04dB 1'b0 : + 0dB  */
#define AUDIO_CODEC_SHIFT_SIDETONE_L_VOL_SEL         4
#define AUDIO_CODEC_MASK_SIDETONE_L_VOL_SEL          ((u32)0x0000007F << 4)                              /*!<R/W 0  sidetone volume select ~0.375db/step 7'h7f : 0B ~ 7'h00 : -47.625db  */
#define AUDIO_CODEC_SHIFT_SIDETONE_L_HPF_FC_SEL      1
#define AUDIO_CODEC_MASK_SIDETONE_L_HPF_FC_SEL       ((u32)0x00000007 << 1)                              /*!<R/W 0  sidetone HPF cut-off frequency select (-6dB) 3'b000 : fc = 2.925e-3*fs, 3'b001 : fc = 1.4625e-3*fs 3'b010 : fc = 7.3125e-4*fs, 3'b011 : fc = 3.65625e-4*fs 3'b100 : fc = 1.828e-4*fs, 3'b101 : fc = 9.14e-5*fs 3'b110 : fc = 4.57e-5*fs, 3'b111 : fc = 2.285e-5*fs */
#define AUDIO_CODEC_SHIFT_SIDETONE_L_HPF_EN          0
#define AUDIO_CODEC_BIT_SIDETONE_L_HPF_EN            ((u32)0x00000001 << 0)                              /*!<R/W 0  sidetone processing enable control for 1'b1 : enable sidetone HPF processing 1'b0 : disable sidetone HPF processing  */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_0FH
 * @brief  index_0fh                                 (@ 0X01E)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_SIDETONE_R_ZDET_FUNC       14
#define AUDIO_CODEC_MASK_SIDETONE_R_ZDET_FUNC        ((u32)0x00000003 << 14)                             /*!<R/W 0   2'b0:immediate change 2'b01: zero detection enable 2'b10: zero detection step change */
#define AUDIO_CODEC_SHIFT_SIDETONE_R_ZDET_TOUT       12
#define AUDIO_CODEC_MASK_SIDETONE_R_ZDET_TOUT        ((u32)0x00000003 << 12)                             /*!<R/W 0  After EQ(samples =fs ): 2'b00: 1024*16 samples 2'b01: 1024*32 samples 2'b10: 1024*64 samples 2'b11: 256 samples  */
#define AUDIO_CODEC_SHIFT_SIDETONE_R_BOOST_SEL       11
#define AUDIO_CODEC_BIT_SIDETONE_R_BOOST_SEL         ((u32)0x00000001 << 11)                             /*!<R/W 0  sidetone boost select 1'b1 : +12dB 1'b0 : + 0dB  */
#define AUDIO_CODEC_SHIFT_SIDETONE_R_VOL_SEL         4
#define AUDIO_CODEC_MASK_SIDETONE_R_VOL_SEL          ((u32)0x0000007F << 4)                              /*!<R/W 0  sidetone volume select ~0.375db/step 7'h7f : 0B ~ 7'h00 : -47.625db  */
#define AUDIO_CODEC_SHIFT_SIDETONE_R_HPF_FC_SEL      1
#define AUDIO_CODEC_MASK_SIDETONE_R_HPF_FC_SEL       ((u32)0x00000007 << 1)                              /*!<R/W 0  sidetone HPF cut-off frequency select (-6dB) 3'b000 : fc = 2.925e-3*fs, 3'b001 : fc = 1.4625e-3*fs 3'b010 : fc = 7.3125e-4*fs, 3'b011 : fc = 3.65625e-4*fs 3'b100 : fc = 1.828e-4*fs, 3'b101 : fc = 9.14e-5*fs 3'b110 : fc = 4.57e-5*fs, 3'b111 : fc = 2.285e-5*fs */
#define AUDIO_CODEC_SHIFT_SIDETONE_R_HPF_EN          0
#define AUDIO_CODEC_BIT_SIDETONE_R_HPF_EN            ((u32)0x00000001 << 0)                              /*!<R/W 0  sidetone processing enable control 1'b1 : enable sidetone HPF processing 1'b0 : disable sidetone HPF processing  */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_10H
 * @brief  index_10h                                 (@ 0X020)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_I2S_DATA_LEN_SEL_RX        14
#define AUDIO_CODEC_MASK_I2S_DATA_LEN_SEL_RX         ((u32)0x00000003 << 14)                             /*!<R/W 0  2'b00: 16 bits; 2'b10: 24 bits; 2'b11: 8 bits; */
#define AUDIO_CODEC_SHIFT_I2S_SAME_LRC               13
#define AUDIO_CODEC_BIT_I2S_SAME_LRC                 ((u32)0x00000001 << 13)                             /*!<R/W 0  1'b1: DA/AD both use lrc_tx 1'b0: separate DA/AD lrc for different sample rate */
#define AUDIO_CODEC_SHIFT_STEREO_I2S_SELF_LPBK_EN    12
#define AUDIO_CODEC_BIT_STEREO_I2S_SELF_LPBK_EN      ((u32)0x00000001 << 12)                             /*!<R/W 0  1'b1: internal loopback mode is enabled */
#define AUDIO_CODEC_SHIFT_SEL_I2S_TX_CH              10
#define AUDIO_CODEC_MASK_SEL_I2S_TX_CH               ((u32)0x00000003 << 10)                             /*!<R/W 0  2'b00: L/R; 2'b01: R/L; 2'b10: L/L; 2'b11: R/R @ DAC path */
#define AUDIO_CODEC_SHIFT_SEL_I2S_RX_CH              8
#define AUDIO_CODEC_MASK_SEL_I2S_RX_CH               ((u32)0x00000003 << 8)                              /*!<R/W 0  2'b00: L/R; 2'b01: R/L; 2'b10: L/L; 2'b11: R/R @ ADC path */
#define AUDIO_CODEC_SHIFT_I2S_RST_N_REG              7
#define AUDIO_CODEC_BIT_I2S_RST_N_REG                ((u32)0x00000001 << 7)                              /*!<R/W 0  1'b1: rst_n to audio digital IP is de-asserted; 1'b0: rst_n to audio digital IP is asserted */
#define AUDIO_CODEC_SHIFT_INV_I2S_SCLK               6
#define AUDIO_CODEC_BIT_INV_I2S_SCLK                 ((u32)0x00000001 << 6)                              /*!<R/W 0  1'b1: I2S/PCM bit clock is inverted */
#define AUDIO_CODEC_SHIFT_I2S_DATA_LEN_SEL_TX        4
#define AUDIO_CODEC_MASK_I2S_DATA_LEN_SEL_TX         ((u32)0x00000003 << 4)                              /*!<R/W 0  2'b00: 16 bits; 2'b10: 24 bits; 2'b11: 8 bits; */
#define AUDIO_CODEC_SHIFT_I2S_DATA_FORMAT_SEL_RX     2
#define AUDIO_CODEC_MASK_I2S_DATA_FORMAT_SEL_RX      ((u32)0x00000003 << 2)                              /*!<R/W 0  2b00: I2S; 2'b01: Left Justified; 2'b10: PCM mode A; 2'b11: PCM mode B;  */
#define AUDIO_CODEC_SHIFT_I2S_DATA_FORMAT_SEL_TX     0
#define AUDIO_CODEC_MASK_I2S_DATA_FORMAT_SEL_TX      ((u32)0x00000003 << 0)                              /*!<R/W 0  2b00: I2S; 2'b01: Left Justified; 2'b10: PCM mode A; 2'b11: PCM mode B;  */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_11H
 * @brief  index_11h                                 (@ 0X022)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_AD_DCHPF_EN          14
#define AUDIO_CODEC_BIT_ADC_L_AD_DCHPF_EN            ((u32)0x00000001 << 14)                             /*!<R/W 1  High pass filter enable control (filter DC): 0: disable 1: enable */
#define AUDIO_CODEC_SHIFT_ADC_L_DMIC_MIX_MUTE        13
#define AUDIO_CODEC_BIT_ADC_L_DMIC_MIX_MUTE          ((u32)0x00000001 << 13)                             /*!<R/W 1  DMIC input path mute control Left Channel: 0: Un-Mute 1: Mute */
#define AUDIO_CODEC_SHIFT_ADC_L_AD_MIX_MUTE          12
#define AUDIO_CODEC_BIT_ADC_L_AD_MIX_MUTE            ((u32)0x00000001 << 12)                             /*!<R/W 1  analog ADC input path mute control Left Channel: 0: Un-Mute 1: Mute */
#define AUDIO_CODEC_SHIFT_ADC_L_AD_LPF1ST_FC_SEL     10
#define AUDIO_CODEC_MASK_ADC_L_AD_LPF1ST_FC_SEL      ((u32)0x00000003 << 10)                             /*!<R/W 0  ADC SRC 1st LPF fc: 00b:31.04khz, 01b:46.92khz, 10b:63.06khz, 11b:79.45khz */
#define AUDIO_CODEC_SHIFT_ADC_L_AD_LPF1ST_EN         9
#define AUDIO_CODEC_BIT_ADC_L_AD_LPF1ST_EN           ((u32)0x00000001 << 9)                              /*!<R/W 1  ADC SRC 1st LPF control: 0: disable 1: enable  */
#define AUDIO_CODEC_SHIFT_ADC_L_AD_LPF2ND_EN         8
#define AUDIO_CODEC_BIT_ADC_L_AD_LPF2ND_EN           ((u32)0x00000001 << 8)                              /*!<R/W 1  ADC SRC 2nd LPF control: 0: disable 1: enable  */
#define AUDIO_CODEC_SHIFT_ADC_L_DMIC_LPF1ST_FC_SEL   5
#define AUDIO_CODEC_MASK_ADC_L_DMIC_LPF1ST_FC_SEL    ((u32)0x00000003 << 5)                              /*!<R/W 0  DMIC SRC 1st LPF fc: 00b:31.04khz, 01b:46.92khz, 10b:63.06khz, 11b:79.45khz */
#define AUDIO_CODEC_SHIFT_ADC_L_DMIC_LPF1ST_EN       4
#define AUDIO_CODEC_BIT_ADC_L_DMIC_LPF1ST_EN         ((u32)0x00000001 << 4)                              /*!<R/W 1  DMIC SRC 1st LPF control: 0: disable 1: enable  */
#define AUDIO_CODEC_SHIFT_ADC_L_DMIC_LPF2ND_EN       3
#define AUDIO_CODEC_BIT_ADC_L_DMIC_LPF2ND_EN         ((u32)0x00000001 << 3)                              /*!<R/W 1  DMIC SRC 2nd LPF control: 0: disable 1: enable  */
#define AUDIO_CODEC_SHIFT_ADC_L_DMIC_SRC_SEL         0
#define AUDIO_CODEC_MASK_ADC_L_DMIC_SRC_SEL          ((u32)0x00000003 << 0)                              /*!<R/W 0  DMIC Data source selection: 2'b00: MIC 1 rising 2'b01: MIC 1 falling 2'b10: MIC 1 rising 2'b11: MIC 1 falling */
/** @} */

