Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_audio_codec_type.h
/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_12H
 * @brief  index_12h                                 (@ 0X024)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_AD_SRC_SEL           13
#define AUDIO_CODEC_MASK_ADC_L_AD_SRC_SEL            ((u32)0x00000003 << 13)                             /*!<R/W 0  ADC Data source selection: 2'b00: ADC1 2'b01: ADC 2 2'b10: ADC 3 2'b11: ADC1 */
#define AUDIO_CODEC_SHIFT_ADC_L_AD_ZDET_TOUT         11
#define AUDIO_CODEC_MASK_ADC_L_AD_ZDET_TOUT          ((u32)0x00000003 << 11)                             /*!<R/W 1  ADC zero detection time out select: 2'b00 : 1024*16 samples 2'b01 : 1024*32 samples 2'b10 : 1024*64 samples 2'b11 : 64 samples */
#define AUDIO_CODEC_SHIFT_ADC_L_AD_ZDET_FUNC         9
#define AUDIO_CODEC_MASK_ADC_L_AD_ZDET_FUNC          ((u32)0x00000003 << 9)                              /*!<R/W 1  ADC zero detection function select: 2'b00 : immediate change 2'b01 : zero detection & immediate change 2'b10 : zero detection & step change 2'b11 : unchange */
#define AUDIO_CODEC_SHIFT_ADC_L_AD_MUTE              8
#define AUDIO_CODEC_BIT_ADC_L_AD_MUTE                ((u32)0x00000001 << 8)                              /*!<R/W 0  Digital Mute From ADC Left Channel Digital Mixer: 0: Un-Mute 1: Mute */
#define AUDIO_CODEC_SHIFT_ADC_L_DMIC_BOOST_GAIN      6
#define AUDIO_CODEC_MASK_ADC_L_DMIC_BOOST_GAIN       ((u32)0x00000003 << 6)                              /*!<R/W 0  DMIC boost gain control: 0:0dB 1:12dB 2:24dB 3:36dB */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_13H
 * @brief  index_13h                                 (@ 0X026)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_DCHPF_FC_SEL         13
#define AUDIO_CODEC_MASK_ADC_L_DCHPF_FC_SEL          ((u32)0x00000007 << 13)                             /*!<R/W 0x5  -6db cut off freq: 3'b000 : fc = 2.925e-3*fs, 3'b001 : fc = 1.4625e-3*fs 3'b010 : fc = 7.3125e-4*fs, 3'b011 : fc = 3.65625e-4*fs 3'b100 : fc = 1.828e-4*fs, 3'b101 : fc = 9.14e-5*fs 3'b110 : fc = 4.57e-5*fs, 3'b111 : fc = 2.285e-5*fs */
#define AUDIO_CODEC_SHIFT_ADC_L_AD_GAIN              6
#define AUDIO_CODEC_MASK_ADC_L_AD_GAIN               ((u32)0x0000007F << 6)                              /*!<R/W 0x2F  ADC digital volume -17.625dB~+30dB in 0.375 dB step (7'h00:-17.625dB, xxx, 7'h2f:0dB, 7'h30:0.375dB, xxx , 7'h7f:30dB) */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_14H
 * @brief  index_14h                                 (@ 0X028)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_AD_DCHPF_EN          14
#define AUDIO_CODEC_BIT_ADC_R_AD_DCHPF_EN            ((u32)0x00000001 << 14)                             /*!<R/W 1  High pass filter enable control (filter DC): 0: disable 1: enable */
#define AUDIO_CODEC_SHIFT_ADC_R_DMIC_MIX_MUTE        13
#define AUDIO_CODEC_BIT_ADC_R_DMIC_MIX_MUTE          ((u32)0x00000001 << 13)                             /*!<R/W 1  DMIC input path mute control Left Channel: 0: Un-Mute 1: Mute */
#define AUDIO_CODEC_SHIFT_ADC_R_AD_MIX_MUTE          12
#define AUDIO_CODEC_BIT_ADC_R_AD_MIX_MUTE            ((u32)0x00000001 << 12)                             /*!<R/W 1  analog ADC input path mute control Left Channel: 0: Un-Mute 1: Mute */
#define AUDIO_CODEC_SHIFT_ADC_R_AD_LPF1ST_FC_SEL     10
#define AUDIO_CODEC_MASK_ADC_R_AD_LPF1ST_FC_SEL      ((u32)0x00000003 << 10)                             /*!<R/W 0  ADC SRC 1st LPF fc: 00b:31.04khz, 01b:46.92khz, 10b:63.06khz, 11b:79.45khz */
#define AUDIO_CODEC_SHIFT_ADC_R_AD_LPF1ST_EN         9
#define AUDIO_CODEC_BIT_ADC_R_AD_LPF1ST_EN           ((u32)0x00000001 << 9)                              /*!<R/W 1  ADC SRC 1st LPF control: 0: disable 1: enable  */
#define AUDIO_CODEC_SHIFT_ADC_R_AD_LPF2ND_EN         8
#define AUDIO_CODEC_BIT_ADC_R_AD_LPF2ND_EN           ((u32)0x00000001 << 8)                              /*!<R/W 1  ADC SRC 2nd LPF control: 0: disable 1: enable  */
#define AUDIO_CODEC_SHIFT_ADC_R_DMIC_LPF1ST_FC_SEL   5
#define AUDIO_CODEC_MASK_ADC_R_DMIC_LPF1ST_FC_SEL    ((u32)0x00000003 << 5)                              /*!<R/W 0  DMIC SRC 1st LPF fc: 00b:31.04khz, 01b:46.92khz, 10b:63.06khz, 11b:79.45khz */
#define AUDIO_CODEC_SHIFT_ADC_R_DMIC_LPF1ST_EN       4
#define AUDIO_CODEC_BIT_ADC_R_DMIC_LPF1ST_EN         ((u32)0x00000001 << 4)                              /*!<R/W 1  DMIC SRC 1st LPF control: 0: disable 1: enable  */
#define AUDIO_CODEC_SHIFT_ADC_R_DMIC_LPF2ND_EN       3
#define AUDIO_CODEC_BIT_ADC_R_DMIC_LPF2ND_EN         ((u32)0x00000001 << 3)                              /*!<R/W 1  DMIC SRC 2nd LPF control: 0: disable 1: enable  */
#define AUDIO_CODEC_SHIFT_ADC_R_DMIC_SRC_SEL         0
#define AUDIO_CODEC_MASK_ADC_R_DMIC_SRC_SEL          ((u32)0x00000003 << 0)                              /*!<R/W 1  DMIC Data source selection: 2'b00: MIC 1 rising 2'b01: MIC 1 falling 2'b10: MIC 2 rising 2'b11: MIC 2 falling */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_15H
 * @brief  index_15h                                 (@ 0X02A)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_AD_SRC_SEL           13
#define AUDIO_CODEC_MASK_ADC_R_AD_SRC_SEL            ((u32)0x00000003 << 13)                             /*!<R/W 1  ADC Data source selection: 2'b00: ADC1 2'b01: ADC 2 2'b10: ADC 3 2'b11: ADC1 */
#define AUDIO_CODEC_SHIFT_ADC_R_AD_ZDET_TOUT         11
#define AUDIO_CODEC_MASK_ADC_R_AD_ZDET_TOUT          ((u32)0x00000003 << 11)                             /*!<R/W 1  ADC zero detection time out select: 2'b00 : 1024*16 samples 2'b01 : 1024*32 samples 2'b10 : 1024*64 samples 2'b11 : 64 samples */
#define AUDIO_CODEC_SHIFT_ADC_R_AD_ZDET_FUNC         9
#define AUDIO_CODEC_MASK_ADC_R_AD_ZDET_FUNC          ((u32)0x00000003 << 9)                              /*!<R/W 1  ADC zero detection function select: 2'b00 : immediate change 2'b01 : zero detection & immediate change 2'b10 : unchange 2'b11 : unchange */
#define AUDIO_CODEC_SHIFT_ADC_R_AD_MUTE              8
#define AUDIO_CODEC_BIT_ADC_R_AD_MUTE                ((u32)0x00000001 << 8)                              /*!<R/W 0  Digital mute from ADC right cheannel digital mixer, 0:un-mute, 1:mute */
#define AUDIO_CODEC_SHIFT_ADC_R_DMIC_BOOST_GAIN      6
#define AUDIO_CODEC_MASK_ADC_R_DMIC_BOOST_GAIN       ((u32)0x00000003 << 6)                              /*!<R/W 0  DMIC boost gain control: 00'b : 0dB 01'b: 12dB 10'b : 24dB 11'b: 36dB */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_16H
 * @brief  index_16h                                 (@ 0X02C)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_DCHPF_FC_SEL         13
#define AUDIO_CODEC_MASK_ADC_R_DCHPF_FC_SEL          ((u32)0x00000007 << 13)                             /*!<R/W 0x5  -3db cut off freq: 3'd0:0.01 * fs 3'd1:5e-3 * fs 3'd2:2.5e-3 *fs 3'd3:1.25e-3 *fs 3'd4: 6.25e-4 *fs 3'd5:3.125e-4*fs 3'd6: 1.5625e-4 *fs 3'd7:7.8125-5*fs */
#define AUDIO_CODEC_SHIFT_ADC_R_AD_GAIN              6
#define AUDIO_CODEC_MASK_ADC_R_AD_GAIN               ((u32)0x0000007F << 6)                              /*!<R/W 0x2F  ADC digital volume -17.625dB~+30dB in 0.375 dB step (7'h00:-17.625dB, xxx, 7'h2f:0dB, 7'h30:0.375dB, xxx , 7'h7f:30dB) */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_17H
 * @brief  index_17h                                 (@ 0X02E)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADDA_SAME_FS_EN            15
#define AUDIO_CODEC_BIT_ADDA_SAME_FS_EN              ((u32)0x00000001 << 15)                             /*!<R/W 0  1'b1 : AD/DA use same sample rate (adc_sample_rate and asrc_rx is useless ) */
#define AUDIO_CODEC_SHIFT_ASRC_FTK_LOOP_GAIN_SEL_TX  13
#define AUDIO_CODEC_MASK_ASRC_FTK_LOOP_GAIN_SEL_TX   ((u32)0x00000003 << 13)                             /*!<R/W 0x3  set loop gain: 2'b00 :2^-8 2'b01:2^-14 2'b10:2^-18 2'b11:2^-20  */
#define AUDIO_CODEC_SHIFT_ASRC_RATE_SEL_RX           12
#define AUDIO_CODEC_BIT_ASRC_RATE_SEL_RX             ((u32)0x00000001 << 12)                             /*!<R/W 0  (1) If ASRC is enabled,adc_sample_rate @0x17[7:4] become useless. (2)If asrc_rate_sel=1'h0 (ASRC output rate @48KHz), I2S word clock rate can be 2KHz ~ 60KHz (3) If asrc_rate_sel=1'h1 (ASRC output rate @96KHz), I2S word clock rate can be 4KHz ~ 120KHz */
#define AUDIO_CODEC_SHIFT_ASRC_RATE_SEL_TX           11
#define AUDIO_CODEC_BIT_ASRC_RATE_SEL_TX             ((u32)0x00000001 << 11)                             /*!<R/W 0  (1) If ASRC is enabled, dac_sample_rate @0x17[3:0] become useless. (2)If asrc_rate_sel=1'h0 (ASRC output rate @48KHz), I2S word clock rate can be 2KHz ~ 60KHz (3) If asrc_rate_sel=1'h1 (ASRC output rate @96KHz), I2S word clock rate can be 4KHz ~ 120KHz */
#define AUDIO_CODEC_SHIFT_DMIC1_CLK_SEL              8
#define AUDIO_CODEC_MASK_DMIC1_CLK_SEL               ((u32)0x00000007 << 8)                              /*!<R/W 1  set clock of digital microphone: 3'b000: 5MHz, 3'b001: 2.5MHz, 3'b010: 1.25MHz, 3'b011: 625kHz, 3'b100: 312.5kHz */
#define AUDIO_CODEC_SHIFT_ADC_SAMPLE_RATE            4
#define AUDIO_CODEC_MASK_ADC_SAMPLE_RATE             ((u32)0x0000000F << 4)                              /*!<R/W 0  set ADC sample rate: 4'h0: 48K, 4'h1: 96K, 4'h2: reserved, 4'h3: 32K 4'h4: reserved, 4'h5: 16K, 4'h6: reserved, 4'h7: 8K 4'h8: 44.1K, 4'h9: 88.2K, 4'hA~4'hF:reserved */
#define AUDIO_CODEC_SHIFT_DAC_SAMPLE_RATE            0
#define AUDIO_CODEC_MASK_DAC_SAMPLE_RATE             ((u32)0x0000000F << 0)                              /*!<R/W 0  set DAC sample rate: 4'h0: 48K, 4'h1: 96K, 4'h2: reserved, 4'h3: 32K 4'h4: reserved, 4'h5: 16K, 4'h6: reserved, 4'h7: 8K 4'h8: 44.1K, 4'h9: 88.2K, 4'hA~4'hF:reserved */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_18H
 * @brief  index_18h                                 (@ 0X030)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DMIC_CLK_EN                15
#define AUDIO_CODEC_BIT_DMIC_CLK_EN                  ((u32)0x00000001 << 15)                             /*!<R/W 0  set digital MIC clock: 1'b0 : turn off clock 1'b1: turn on clock  */
#define AUDIO_CODEC_SHIFT_DMIC_R_EN                  14
#define AUDIO_CODEC_BIT_DMIC_R_EN                    ((u32)0x00000001 << 14)                             /*!<R/W 0  set ADC filter right channel digital MIC pathclock: 1'b0 : turn off clock and reset 1'b1: turn on clock  */
#define AUDIO_CODEC_SHIFT_DMIC_L_EN                  13
#define AUDIO_CODEC_BIT_DMIC_L_EN                    ((u32)0x00000001 << 13)                             /*!<R/W 0  set ADC filter left channel digital MIC path clock: 1'b0 : turn off clock and reset 1'b1: turn on clock  */
#define AUDIO_CODEC_SHIFT_AD_ANA_R_EN                12
#define AUDIO_CODEC_BIT_AD_ANA_R_EN                  ((u32)0x00000001 << 12)                             /*!<R/W 0  set ADC filter right channel analog ADC pathclock: 1'b0 : turn off clock and reset 1'b1: turn on clock  */
#define AUDIO_CODEC_SHIFT_AD_ANA_L_EN                11
#define AUDIO_CODEC_BIT_AD_ANA_L_EN                  ((u32)0x00000001 << 11)                             /*!<R/W 0  set ADC filter left channel analog ADC path clock: 1'b0 : turn off clock and reset 1'b1: turn on clock  */
#define AUDIO_CODEC_SHIFT_AD_ANA_CLK_EN              10
#define AUDIO_CODEC_BIT_AD_ANA_CLK_EN                ((u32)0x00000001 << 10)                             /*!<R/W 0  set ADC analog clock: 1'b0 : turn off clock 1'b1: turn on clock  */
#define AUDIO_CODEC_SHIFT_AD_FIFO_EN                 9
#define AUDIO_CODEC_BIT_AD_FIFO_EN                   ((u32)0x00000001 << 9)                              /*!<R/W 0  set ADC fifo clock: 1'b0 : turn off clock and reset 1'b1: turn on clock  */
#define AUDIO_CODEC_SHIFT_AD_R_EN                    8
#define AUDIO_CODEC_BIT_AD_R_EN                      ((u32)0x00000001 << 8)                              /*!<R/W 0  set ADC filter right channel clock: 1'b0 : turn off clock and reset 1'b1: turn on clock  */
#define AUDIO_CODEC_SHIFT_AD_L_EN                    7
#define AUDIO_CODEC_BIT_AD_L_EN                      ((u32)0x00000001 << 7)                              /*!<R/W 0  set ADC filter left channel clock: 1'b0 : turn off clock and reset 1'b1: turn on clock  */
#define AUDIO_CODEC_SHIFT_DA_FIFO_EN                 5
#define AUDIO_CODEC_BIT_DA_FIFO_EN                   ((u32)0x00000001 << 5)                              /*!<R/W 0  set DAC fifo clock: 1'b0 : turn off clock and reset 1'b1: turn on clock  */
#define AUDIO_CODEC_SHIFT_DA_ANA_CLK_EN              4
#define AUDIO_CODEC_BIT_DA_ANA_CLK_EN                ((u32)0x00000001 << 4)                              /*!<R/W 0  set DAC analog clock: 1'b0 : turn off clock 1'b1: turn on clock  */
#define AUDIO_CODEC_SHIFT_MOD_L_EN                   2
#define AUDIO_CODEC_BIT_MOD_L_EN                     ((u32)0x00000001 << 2)                              /*!<R/W 0  set DAC modulation left channel clock: 1'b0 : turn off clock and reset 1'b1: turn on clock  */
#define AUDIO_CODEC_SHIFT_DA_L_EN                    0
#define AUDIO_CODEC_BIT_DA_L_EN                      ((u32)0x00000001 << 0)                              /*!<R/W 0  set DAC filter left channel clock: 1'b0 : turn off clock and reset 1'b1: turn on clock  */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_19H
 * @brief  index_19h                                 (@ 0X032)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ASRC_FTK_SDM_INI_TX        0
#define AUDIO_CODEC_MASK_ASRC_FTK_SDM_INI_TX         ((u32)0x0000FFFF << 0)                              /*!<R/W 0  set initial value of tracked frequency */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_1AH
 * @brief  index_1ah                                 (@ 0X034)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ASRC_FTK_SDM_INI_RX        0
#define AUDIO_CODEC_MASK_ASRC_FTK_SDM_INI_RX         ((u32)0x0000FFFF << 0)                              /*!<R/W 0  set initial value of tracked frequency */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_1BH
 * @brief  index_1bh                                 (@ 0X036)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ASRC_FTK_LOOP_GAIN_SEL_RX  14
#define AUDIO_CODEC_MASK_ASRC_FTK_LOOP_GAIN_SEL_RX   ((u32)0x00000003 << 14)                             /*!<R/W 0x3  set loop gain: 2'b00 :2^-8 2'b01:2^-14 2'b10:2^-18 2'b11:2^-20  */
#define AUDIO_CODEC_SHIFT_AD_ANA_CLK_SEL             13
#define AUDIO_CODEC_BIT_AD_ANA_CLK_SEL               ((u32)0x00000001 << 13)                             /*!<R/W 0  set clk_ad_ana phase ( reference clk_da_ana): 1'b0 : inphase 1'b1: inverse phase  */
#define AUDIO_CODEC_SHIFT_DA_ANA_CLK_SEL             12
#define AUDIO_CODEC_BIT_DA_ANA_CLK_SEL               ((u32)0x00000001 << 12)                             /*!<R/W 0  set clk_da_ana phase : 1'b0 : inphase 1'b1: inverse phase  */
#define AUDIO_CODEC_SHIFT_ADC_LATCH_PHASE            7
#define AUDIO_CODEC_BIT_ADC_LATCH_PHASE              ((u32)0x00000001 << 7)                              /*!<R/W 0  set latch adc data phase : 1'b0 : inphase 1'b1: inverse phase  */
#define AUDIO_CODEC_SHIFT_ASRC_RX_EN                 4
#define AUDIO_CODEC_BIT_ASRC_RX_EN                   ((u32)0x00000001 << 4)                              /*!<R/W 0  set asynchronous sample rate conversion: 1'b0: disable 1'b1:enable */
#define AUDIO_CODEC_SHIFT_ASRC_TX_EN                 3
#define AUDIO_CODEC_BIT_ASRC_TX_EN                   ((u32)0x00000001 << 3)                              /*!<R/W 0  set asynchronous sample rate conversion: 1'b0: disable 1'b1:enable */
#define AUDIO_CODEC_SHIFT_ASRC_AUTO_ADJUST_RX        2
#define AUDIO_CODEC_BIT_ASRC_AUTO_ADJUST_RX          ((u32)0x00000001 << 2)                              /*!<R/W 1  set HW auto adjust loop gain: 1'b0 : disable 1'b1: enable */
#define AUDIO_CODEC_SHIFT_ASRC_AUTO_ADJUST_TX        1
#define AUDIO_CODEC_BIT_ASRC_AUTO_ADJUST_TX          ((u32)0x00000001 << 1)                              /*!<R/W 1  set HW auto adjust loop gain: 1'b0 : disable 1'b1: enable */
#define AUDIO_CODEC_SHIFT_AUDIO_IP_TCON_EN           0
#define AUDIO_CODEC_BIT_AUDIO_IP_TCON_EN             ((u32)0x00000001 << 0)                              /*!<R/W 0  set audio ip tcon: 1'b0 : disable and reset 1'b1: enable */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_2BH
 * @brief  index_2bh                                 (@ 0X056)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_H0_1_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_H0_1_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 1st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_2CH
 * @brief  index_2ch                                 (@ 0X058)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_H0_1_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_H0_1_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0x200  DAC Lch EQ 1st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_2DH
 * @brief  index_2dh                                 (@ 0X05A)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B1_1_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B1_1_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 1st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_2EH
 * @brief  index_2eh                                 (@ 0X05C)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B1_1_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B1_1_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 1st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_2FH
 * @brief  index_2fh                                 (@ 0X05E)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B2_1_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B2_1_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 1st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_30H
 * @brief  index_30h                                 (@ 0X060)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B2_1_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B2_1_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 1st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_31H
 * @brief  index_31h                                 (@ 0X062)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A1_1_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A1_1_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 1st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_32H
 * @brief  index_32h                                 (@ 0X064)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A1_1_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A1_1_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 1st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_33H
 * @brief  index_33h                                 (@ 0X066)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A2_1_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A2_1_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 1st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_34H
 * @brief  index_34h                                 (@ 0X068)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_EN_1          13
#define AUDIO_CODEC_BIT_DAC_L_BIQUAD_EN_1            ((u32)0x00000001 << 13)                             /*!<R/W 0  DAC Lch 1st-band EQ biquad control 1'b0: Disable 1'b1: Enable */
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A2_1_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A2_1_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 1st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_35H
 * @brief  index_35h                                 (@ 0X06A)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_H0_2_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_H0_2_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 2st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

