Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_audio_codec_type.h
/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_36H
 * @brief  index_36h                                 (@ 0X06C)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_H0_2_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_H0_2_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0x200  DAC Lch EQ 2st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_37H
 * @brief  index_37h                                 (@ 0X06E)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B1_2_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B1_2_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 2st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_38H
 * @brief  index_38h                                 (@ 0X070)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B1_2_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B1_2_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 2st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_39H
 * @brief  index_39h                                 (@ 0X072)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B2_2_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B2_2_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 2st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_3AH
 * @brief  index_3ah                                 (@ 0X074)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B2_2_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B2_2_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 2st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_3BH
 * @brief  index_3bh                                 (@ 0X076)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A1_2_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A1_2_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 2st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_3CH
 * @brief  index_3ch                                 (@ 0X078)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A1_2_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A1_2_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 2st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_3DH
 * @brief  index_3dh                                 (@ 0X07A)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A2_2_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A2_2_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 2st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_3EH
 * @brief  index_3eh                                 (@ 0X07C)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_EN_2          13
#define AUDIO_CODEC_BIT_DAC_L_BIQUAD_EN_2            ((u32)0x00000001 << 13)                             /*!<R/W 0  DAC Lch 2st-band EQ biquad control 1'b0: Disable 1'b1: Enable */
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A2_2_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A2_2_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 2st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_3FH
 * @brief  index_3fh                                 (@ 0X07E)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_H0_3_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_H0_3_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 3st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_40H
 * @brief  index_40h                                 (@ 0X080)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_H0_3_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_H0_3_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0x200  DAC Lch EQ 3st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_41H
 * @brief  index_41h                                 (@ 0X082)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B1_3_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B1_3_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 3st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_42H
 * @brief  index_42h                                 (@ 0X084)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B1_3_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B1_3_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 3st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_43H
 * @brief  index_43h                                 (@ 0X086)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B2_3_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B2_3_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 3st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_44H
 * @brief  index_44h                                 (@ 0X088)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B2_3_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B2_3_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 3st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_45H
 * @brief  index_45h                                 (@ 0X08A)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A1_3_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A1_3_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 3st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_46H
 * @brief  index_46h                                 (@ 0X08C)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A1_3_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A1_3_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 3st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_47H
 * @brief  index_47h                                 (@ 0X08E)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A2_3_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A2_3_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 3st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_48H
 * @brief  index_48h                                 (@ 0X090)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_EN_3          13
#define AUDIO_CODEC_BIT_DAC_L_BIQUAD_EN_3            ((u32)0x00000001 << 13)                             /*!<R/W 0  DAC Lch 3st-band EQ biquad control 1'b0: Disable 1'b1: Enable */
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A2_3_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A2_3_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 3st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_49H
 * @brief  index_49h                                 (@ 0X092)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_H0_4_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_H0_4_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 4st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_4AH
 * @brief  index_4ah                                 (@ 0X094)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_H0_4_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_H0_4_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0x200  DAC Lch EQ 4st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_4BH
 * @brief  index_4bh                                 (@ 0X096)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B1_4_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B1_4_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 4st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_4CH
 * @brief  index_4ch                                 (@ 0X098)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B1_4_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B1_4_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 4st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_4DH
 * @brief  index_4dh                                 (@ 0X09A)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B2_4_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B2_4_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 4st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_4EH
 * @brief  index_4eh                                 (@ 0X09C)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B2_4_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B2_4_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 4st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_4FH
 * @brief  index_4fh                                 (@ 0X09E)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A1_4_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A1_4_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 4st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_50H
 * @brief  index_50h                                 (@ 0X0A0)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A1_4_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A1_4_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 4st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_51H
 * @brief  index_51h                                 (@ 0X0A2)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A2_4_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A2_4_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 4st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_52H
 * @brief  index_52h                                 (@ 0X0A4)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_EN_4          13
#define AUDIO_CODEC_BIT_DAC_L_BIQUAD_EN_4            ((u32)0x00000001 << 13)                             /*!<R/W 0  DAC Lch 4st-band EQ biquad control 1'b0: Disable 1'b1: Enable */
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A2_4_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A2_4_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 4st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_53H
 * @brief  index_53h                                 (@ 0X0A6)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_H0_5_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_H0_5_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 5st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_54H
 * @brief  index_54h                                 (@ 0X0A8)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_H0_5_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_H0_5_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0x200  DAC Lch EQ 5st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_55H
 * @brief  index_55h                                 (@ 0X0AA)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B1_5_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B1_5_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 5st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_56H
 * @brief  index_56h                                 (@ 0X0AC)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B1_5_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B1_5_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 5st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_57H
 * @brief  index_57h                                 (@ 0X0AE)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B2_5_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B2_5_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 5st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_58H
 * @brief  index_58h                                 (@ 0X0B0)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_B2_5_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_B2_5_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 5st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_59H
 * @brief  index_59h                                 (@ 0X0B2)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A1_5_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A1_5_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 5st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_5AH
 * @brief  index_5ah                                 (@ 0X0B4)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A1_5_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A1_5_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 5st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_5BH
 * @brief  index_5bh                                 (@ 0X0B6)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A2_5_BIT15TO0 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A2_5_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DAC Lch EQ 5st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_5CH
 * @brief  index_5ch                                 (@ 0X0B8)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_EN_5          13
#define AUDIO_CODEC_BIT_DAC_L_BIQUAD_EN_5            ((u32)0x00000001 << 13)                             /*!<R/W 0  DAC Lch 5st-band EQ biquad control 1'b0: Disable 1'b1: Enable */
#define AUDIO_CODEC_SHIFT_DAC_L_BIQUAD_A2_5_BIT28TO16 0
#define AUDIO_CODEC_MASK_DAC_L_BIQUAD_A2_5_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  DAC Lch EQ 5st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_91H
 * @brief  index_91h                                 (@ 0X122)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_H0_1_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_H0_1_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 1st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_92H
 * @brief  index_92h                                 (@ 0X124)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_H0_1_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_H0_1_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0x200  ADC Lch EQ 1st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_93H
 * @brief  index_93h                                 (@ 0X126)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B1_1_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B1_1_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 1st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

