Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_audio_codec_type.h
/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_94H
 * @brief  index_94h                                 (@ 0X128)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B1_1_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B1_1_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 1st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_95H
 * @brief  index_95h                                 (@ 0X12A)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B2_1_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B2_1_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 1st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_96H
 * @brief  index_96h                                 (@ 0X12C)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B2_1_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B2_1_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 1st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_97H
 * @brief  index_97h                                 (@ 0X12E)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A1_1_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A1_1_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 1st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_98H
 * @brief  index_98h                                 (@ 0X130)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A1_1_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A1_1_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 1st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_99H
 * @brief  index_99h                                 (@ 0X132)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A2_1_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A2_1_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 1st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_9AH
 * @brief  index_9ah                                 (@ 0X134)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_EN_1          13
#define AUDIO_CODEC_BIT_ADC_L_BIQUAD_EN_1            ((u32)0x00000001 << 13)                             /*!<R/W 0  ADC Lch 1st-band EQ biquad control 1'b0: Disable 1'b1: Enable */
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A2_1_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A2_1_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 1st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_9BH
 * @brief  index_9bh                                 (@ 0X136)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_H0_2_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_H0_2_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 2st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_9CH
 * @brief  index_9ch                                 (@ 0X138)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_H0_2_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_H0_2_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0x200  ADC Lch EQ 2st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_9DH
 * @brief  index_9dh                                 (@ 0X13A)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B1_2_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B1_2_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 2st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_9EH
 * @brief  index_9eh                                 (@ 0X13C)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B1_2_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B1_2_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 2st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_9FH
 * @brief  index_9fh                                 (@ 0X13E)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B2_2_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B2_2_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 2st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_A0H
 * @brief  index_a0h                                 (@ 0X140)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B2_2_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B2_2_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 2st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_A1H
 * @brief  index_a1h                                 (@ 0X142)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A1_2_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A1_2_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 2st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_A2H
 * @brief  index_a2h                                 (@ 0X144)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A1_2_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A1_2_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 2st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_A3H
 * @brief  index_a3h                                 (@ 0X146)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A2_2_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A2_2_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 2st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_A4H
 * @brief  index_a4h                                 (@ 0X148)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_EN_2          13
#define AUDIO_CODEC_BIT_ADC_L_BIQUAD_EN_2            ((u32)0x00000001 << 13)                             /*!<R/W 0  ADC Lch 2st-band EQ biquad control 1'b0: Disable 1'b1: Enable */
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A2_2_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A2_2_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 2st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_A5H
 * @brief  index_a5h                                 (@ 0X14A)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_H0_3_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_H0_3_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 3st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_A6H
 * @brief  index_a6h                                 (@ 0X14C)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_H0_3_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_H0_3_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0x200  ADC Lch EQ 3st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_A7H
 * @brief  index_a7h                                 (@ 0X14E)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B1_3_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B1_3_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 3st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_A8H
 * @brief  index_a8h                                 (@ 0X150)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B1_3_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B1_3_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 3st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_A9H
 * @brief  index_a9h                                 (@ 0X152)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B2_3_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B2_3_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 3st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_AAH
 * @brief  index_aah                                 (@ 0X154)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B2_3_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B2_3_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 3st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_ABH
 * @brief  index_abh                                 (@ 0X156)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A1_3_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A1_3_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 3st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_ACH
 * @brief  index_ach                                 (@ 0X158)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A1_3_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A1_3_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 3st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_ADH
 * @brief  index_adh                                 (@ 0X15A)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A2_3_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A2_3_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 3st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_AEH
 * @brief  index_aeh                                 (@ 0X15C)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_EN_3          13
#define AUDIO_CODEC_BIT_ADC_L_BIQUAD_EN_3            ((u32)0x00000001 << 13)                             /*!<R/W 0  ADC Lch 3st-band EQ biquad control 1'b0: Disable 1'b1: Enable */
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A2_3_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A2_3_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 3st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_AFH
 * @brief  index_afh                                 (@ 0X15E)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_H0_4_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_H0_4_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 4st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_B0H
 * @brief  index_b0h                                 (@ 0X160)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_H0_4_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_H0_4_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0x200  ADC Lch EQ 4st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_B1H
 * @brief  index_b1h                                 (@ 0X162)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B1_4_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B1_4_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 4st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_B2H
 * @brief  index_b2h                                 (@ 0X164)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B1_4_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B1_4_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 4st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_B3H
 * @brief  index_b3h                                 (@ 0X166)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B2_4_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B2_4_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 4st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_B4H
 * @brief  index_b4h                                 (@ 0X168)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B2_4_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B2_4_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 4st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_B5H
 * @brief  index_b5h                                 (@ 0X16A)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A1_4_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A1_4_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 4st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_B6H
 * @brief  index_b6h                                 (@ 0X16C)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A1_4_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A1_4_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 4st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_B7H
 * @brief  index_b7h                                 (@ 0X16E)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A2_4_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A2_4_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 4st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_B8H
 * @brief  index_b8h                                 (@ 0X170)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_EN_4          13
#define AUDIO_CODEC_BIT_ADC_L_BIQUAD_EN_4            ((u32)0x00000001 << 13)                             /*!<R/W 0  ADC Lch 4st-band EQ biquad control 1'b0: Disable 1'b1: Enable */
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A2_4_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A2_4_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 4st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_B9H
 * @brief  index_b9h                                 (@ 0X172)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_H0_5_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_H0_5_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 5st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_BAH
 * @brief  index_bah                                 (@ 0X174)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_H0_5_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_H0_5_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0x200  ADC Lch EQ 5st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_BBH
 * @brief  index_bbh                                 (@ 0X176)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B1_5_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B1_5_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 5st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_BCH
 * @brief  index_bch                                 (@ 0X178)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B1_5_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B1_5_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 5st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_BDH
 * @brief  index_bdh                                 (@ 0X17A)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B2_5_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B2_5_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 5st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

