Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_audio_codec_type.h
/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_BEH
 * @brief  index_beh                                 (@ 0X17C)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_B2_5_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_B2_5_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 5st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_BFH
 * @brief  index_bfh                                 (@ 0X17E)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A1_5_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A1_5_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 5st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_C0H
 * @brief  index_c0h                                 (@ 0X180)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A1_5_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A1_5_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 5st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_C1H
 * @brief  index_c1h                                 (@ 0X182)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A2_5_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A2_5_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Lch EQ 5st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_C2H
 * @brief  index_c2h                                 (@ 0X184)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_EN_5          13
#define AUDIO_CODEC_BIT_ADC_L_BIQUAD_EN_5            ((u32)0x00000001 << 13)                             /*!<R/W 0  ADC Lch 5st-band EQ biquad control 1'b0: Disable 1'b1: Enable */
#define AUDIO_CODEC_SHIFT_ADC_L_BIQUAD_A2_5_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_L_BIQUAD_A2_5_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Lch EQ 5st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_C4H
 * @brief  index_c4h                                 (@ 0X188)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_H0_1_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_H0_1_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 1st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_C5H
 * @brief  index_c5h                                 (@ 0X18A)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_H0_1_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_H0_1_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0x200  ADC Rch EQ 1st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_C6H
 * @brief  index_c6h                                 (@ 0X18C)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B1_1_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B1_1_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 1st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_C7H
 * @brief  index_c7h                                 (@ 0X18E)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B1_1_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B1_1_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 1st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_C8H
 * @brief  index_c8h                                 (@ 0X190)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B2_1_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B2_1_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 1st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_C9H
 * @brief  index_c9h                                 (@ 0X192)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B2_1_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B2_1_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 1st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_CAH
 * @brief  index_cah                                 (@ 0X194)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A1_1_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A1_1_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 1st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_CBH
 * @brief  index_cbh                                 (@ 0X196)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A1_1_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A1_1_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 1st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_CCH
 * @brief  index_cch                                 (@ 0X198)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A2_1_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A2_1_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 1st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_CDH
 * @brief  index_cdh                                 (@ 0X19A)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_EN_1          13
#define AUDIO_CODEC_BIT_ADC_R_BIQUAD_EN_1            ((u32)0x00000001 << 13)                             /*!<R/W 0  ADC Rch 1st-band EQ biquad control 1'b0: Disable 1'b1: Enable */
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A2_1_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A2_1_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 1st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_CEH
 * @brief  index_ceh                                 (@ 0X19C)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_H0_2_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_H0_2_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 2st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_CFH
 * @brief  index_cfh                                 (@ 0X19E)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_H0_2_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_H0_2_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0x200  ADC Rch EQ 2st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_D0H
 * @brief  index_d0h                                 (@ 0X1A0)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B1_2_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B1_2_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 2st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_D1H
 * @brief  index_d1h                                 (@ 0X1A2)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B1_2_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B1_2_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 2st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_D2H
 * @brief  index_d2h                                 (@ 0X1A4)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B2_2_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B2_2_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 2st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_D3H
 * @brief  index_d3h                                 (@ 0X1A6)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B2_2_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B2_2_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 2st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_D4H
 * @brief  index_d4h                                 (@ 0X1A8)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A1_2_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A1_2_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 2st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_D5H
 * @brief  index_d5h                                 (@ 0X1AA)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A1_2_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A1_2_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 2st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_D6H
 * @brief  index_d6h                                 (@ 0X1AC)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A2_2_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A2_2_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 2st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_D7H
 * @brief  index_d7h                                 (@ 0X1AE)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_EN_2          13
#define AUDIO_CODEC_BIT_ADC_R_BIQUAD_EN_2            ((u32)0x00000001 << 13)                             /*!<R/W 0  ADC Rch 2st-band EQ biquad control 1'b0: Disable 1'b1: Enable */
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A2_2_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A2_2_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 2st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_D8H
 * @brief  index_d8h                                 (@ 0X1B0)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_H0_3_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_H0_3_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 3st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_D9H
 * @brief  index_d9h                                 (@ 0X1B2)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_H0_3_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_H0_3_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0x200  ADC Rch EQ 3st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_DAH
 * @brief  index_dah                                 (@ 0X1B4)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B1_3_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B1_3_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 3st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_DBH
 * @brief  index_dbh                                 (@ 0X1B6)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B1_3_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B1_3_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 3st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_DCH
 * @brief  index_dch                                 (@ 0X1B8)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B2_3_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B2_3_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 3st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_DDH
 * @brief  index_ddh                                 (@ 0X1BA)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B2_3_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B2_3_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 3st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_DEH
 * @brief  index_deh                                 (@ 0X1BC)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A1_3_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A1_3_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 3st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_DFH
 * @brief  index_dfh                                 (@ 0X1BE)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A1_3_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A1_3_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 3st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_E0H
 * @brief  index_e0h                                 (@ 0X1C0)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A2_3_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A2_3_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 3st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_E1H
 * @brief  index_e1h                                 (@ 0X1C2)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_EN_3          13
#define AUDIO_CODEC_BIT_ADC_R_BIQUAD_EN_3            ((u32)0x00000001 << 13)                             /*!<R/W 0  ADC Rch 3st-band EQ biquad control 1'b0: Disable 1'b1: Enable */
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A2_3_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A2_3_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 3st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_E2H
 * @brief  index_e2h                                 (@ 0X1C4)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_H0_4_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_H0_4_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 4st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_E3H
 * @brief  index_e3h                                 (@ 0X1C6)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_H0_4_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_H0_4_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0x200  ADC Rch EQ 4st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_E4H
 * @brief  index_e4h                                 (@ 0X1C8)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B1_4_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B1_4_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 4st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_E5H
 * @brief  index_e5h                                 (@ 0X1CA)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B1_4_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B1_4_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 4st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_E6H
 * @brief  index_e6h                                 (@ 0X1CC)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B2_4_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B2_4_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 4st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_E7H
 * @brief  index_e7h                                 (@ 0X1CE)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B2_4_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B2_4_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 4st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_E8H
 * @brief  index_e8h                                 (@ 0X1D0)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A1_4_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A1_4_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 4st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

