Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_audio_codec_type.h
/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_E9H
 * @brief  index_E9h                                 (@ 0X1D2)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A1_4_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A1_4_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 4st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_EAH
 * @brief  index_eah                                 (@ 0X1D4)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A2_4_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A2_4_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 4st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_EBH
 * @brief  index_ebh                                 (@ 0X1D6)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_EN_4          13
#define AUDIO_CODEC_BIT_ADC_R_BIQUAD_EN_4            ((u32)0x00000001 << 13)                             /*!<R/W 0  ADC Rch 4st-band EQ biquad control 1'b0: Disable 1'b1: Enable */
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A2_4_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A2_4_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 4st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_ECH
 * @brief  index_ech                                 (@ 0X1D8)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_H0_5_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_H0_5_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 5st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_EDH
 * @brief  index_edh                                 (@ 0X1DA)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_H0_5_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_H0_5_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0x200  ADC Rch EQ 5st-band coef. h0 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_EEH
 * @brief  index_eeh                                 (@ 0X1DC)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B1_5_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B1_5_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 5st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_EFH
 * @brief  index_efh                                 (@ 0X1DE)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B1_5_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B1_5_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 5st-band coef. b1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_F0H
 * @brief  index_f0h                                 (@ 0X1E0)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B2_5_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B2_5_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 5st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_F1H
 * @brief  index_f1h                                 (@ 0X1E2)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_B2_5_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_B2_5_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 5st-band coef. b2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_F2H
 * @brief  index_f2h                                 (@ 0X1E4)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A1_5_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A1_5_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 5st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_F3H
 * @brief  index_f3h                                 (@ 0X1E6)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A1_5_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A1_5_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 5st-band coef. a1 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_F4H
 * @brief  index_f4h                                 (@ 0X1E8)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A2_5_BIT15TO0 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A2_5_BIT15TO0  ((u32)0x0000FFFF << 0)                              /*!<R/W 0  ADC Rch EQ 5st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_F5H
 * @brief  index_f5h                                 (@ 0X1EA)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_EN_5          13
#define AUDIO_CODEC_BIT_ADC_R_BIQUAD_EN_5            ((u32)0x00000001 << 13)                             /*!<R/W 0  ADC Rch 5st-band EQ biquad control 1'b0: Disable 1'b1: Enable */
#define AUDIO_CODEC_SHIFT_ADC_R_BIQUAD_A2_5_BIT28TO16 0
#define AUDIO_CODEC_MASK_ADC_R_BIQUAD_A2_5_BIT28TO16 ((u32)0x00001FFF << 0)                              /*!<R/W 0  ADC Rch EQ 5st-band coef. a2 2's complement in 4.25 format, i.e. the range is from -8~7.99. */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_F6H
 * @brief  index_f6h                                 (@ 0X1EC)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_SILENECE_DET_MONO_STATUS 11
#define AUDIO_CODEC_BIT_DAC_L_SILENECE_DET_MONO_STATUS ((u32)0x00000001 << 11)                             /*!<R 0  ongoing status of dac_l_silence detection 1'b0: dac_l_silence detection is resting (clk is gating) 1'b1: dac_l_silence detection is working  */
#define AUDIO_CODEC_SHIFT_DAC_L_SILENCE_DET_MONO_O   10
#define AUDIO_CODEC_BIT_DAC_L_SILENCE_DET_MONO_O     ((u32)0x00000001 << 10)                             /*!<R 1  dac_l_silence data status (result of silence detection) 1'b0: not dac_l_silence data ; 1'b1: dac_l_silence is detected  */
#define AUDIO_CODEC_SHIFT_DAC_L_SILENCE_MONO_DEBOUNCE_SEL 7
#define AUDIO_CODEC_MASK_DAC_L_SILENCE_MONO_DEBOUNCE_SEL ((u32)0x00000007 << 7)                              /*!<R/W 0x3  dac_l_silence data detection debounce control 3'b000: debounce 80ms at sample rate 48k 3'b001: debounce 160ms at sample rate 48k 3'b010: debounce 320ms at sample rate 48k 3'b011: debounce 640ms at sample rate 48k 3'b100: debounce 1.28 s at sample rate 48k 3'b101: debounce 2.56 s at sample rate 48k 3'b110: debounce 5.12 s at sample rate 48k 3'b111: debounce 0.16ms at sample rate 48k (test mode) */
#define AUDIO_CODEC_SHIFT_DAC_L_SILENCE_MONO_LEVEL_SEL 4
#define AUDIO_CODEC_MASK_DAC_L_SILENCE_MONO_LEVEL_SEL ((u32)0x00000007 << 4)                              /*!<R/W 1  dac_l_silence data detection threshold register control 3'b000: -78 db ; 3'b001: -84 db ; 3'b010: -90 db ; 3'b011: -102db 3'b100: -108db ; 3'b101: -114db ; 3'b110: -126db ; 3'b111: -132db */
#define AUDIO_CODEC_SHIFT_DAC_L_SILENCE_DET_MONO_EN  0
#define AUDIO_CODEC_BIT_DAC_L_SILENCE_DET_MONO_EN    ((u32)0x00000001 << 0)                              /*!<R/W 0  dac_l_silence data detection enable contorl 1'b0: diable dac_l_silence data detection 1'b1: enable dac_l_silence data detection */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_F8H
 * @brief  index_f8h                                 (@ 0X1F0)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_L_SILENECE_DET_MONO_STATUS 11
#define AUDIO_CODEC_BIT_ADC_L_SILENECE_DET_MONO_STATUS ((u32)0x00000001 << 11)                             /*!<R 0  status of adc_l_silence detection 1'b0: adc_l_silence detection is resting (clk is gating) 1'b1: adc_l_silence detection is working  */
#define AUDIO_CODEC_SHIFT_ADC_L_SILENCE_DET_MONO_O   10
#define AUDIO_CODEC_BIT_ADC_L_SILENCE_DET_MONO_O     ((u32)0x00000001 << 10)                             /*!<R 1  adc_l_silence data status 1'b0: not adc_l_silence data ; 1'b1: adc_l_silence is detected  */
#define AUDIO_CODEC_SHIFT_ADC_L_SILENCE_MONO_DEBOUNCE_SEL 7
#define AUDIO_CODEC_MASK_ADC_L_SILENCE_MONO_DEBOUNCE_SEL ((u32)0x00000007 << 7)                              /*!<R/W 0x3  adc_l_silence data detection debounce control 3'b000: debounce 80ms at sample rate 48k 3'b001: debounce 160ms at sample rate 48k 3'b010: debounce 320ms at sample rate 48k 3'b011: debounce 640ms at sample rate 48k 3'b100: debounce 1.28 s at sample rate 48k 3'b101: debounce 2.56 s at sample rate 48k 3'b110: debounce 5.12 s at sample rate 48k 3'b111: debounce 0.16ms at sample rate 48k (test mode) */
#define AUDIO_CODEC_SHIFT_ADC_L_SILENCE_MONO_LEVEL_SEL 4
#define AUDIO_CODEC_MASK_ADC_L_SILENCE_MONO_LEVEL_SEL ((u32)0x00000007 << 4)                              /*!<R/W 1  adc_l_silence data detection threshold register control 3'b000: -78 db ; 3'b001: -84 db ; 3'b010: -90 db ; 3'b011: -102db 3'b100: -108db ; 3'b101: -114db ; 3'b110: -126db ; 3'b111: -132db */
#define AUDIO_CODEC_SHIFT_ADC_L_SILENCE_DET_MONO_EN  0
#define AUDIO_CODEC_BIT_ADC_L_SILENCE_DET_MONO_EN    ((u32)0x00000001 << 0)                              /*!<R/W 0  adc_l_silence data detection enable contorl 1'b0: diable adc_l_silence data detection 1'b1: enable adc_l_silence data detection */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_F9H
 * @brief  index_f9h                                 (@ 0X1F2)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADC_R_SILENECE_DET_MONO_STATUS 11
#define AUDIO_CODEC_BIT_ADC_R_SILENECE_DET_MONO_STATUS ((u32)0x00000001 << 11)                             /*!<R 0  status of adc_r_silence detection 1'b0: adc_r_silence detection is resting (clk is gating) 1'b1: adc_r_silence detection is working  */
#define AUDIO_CODEC_SHIFT_ADC_R_SILENCE_DET_MONO_O   10
#define AUDIO_CODEC_BIT_ADC_R_SILENCE_DET_MONO_O     ((u32)0x00000001 << 10)                             /*!<R 1  adc_r_silence data status 1'b0: not adc_r_silence data ; 1'b1: adc_r_silence is detected  */
#define AUDIO_CODEC_SHIFT_ADC_R_SILENCE_MONO_DEBOUNCE_SEL 7
#define AUDIO_CODEC_MASK_ADC_R_SILENCE_MONO_DEBOUNCE_SEL ((u32)0x00000007 << 7)                              /*!<R/W 0x3  adc_r_silence data detection debounce control 3'b000: debounce 80ms at sample rate 48k 3'b001: debounce 160ms at sample rate 48k 3'b010: debounce 320ms at sample rate 48k 3'b011: debounce 640ms at sample rate 48k 3'b100: debounce 1.28 s at sample rate 48k 3'b101: debounce 2.56 s at sample rate 48k 3'b110: debounce 5.12 s at sample rate 48k 3'b111: debounce 0.16ms at sample rate 48k (test mode) */
#define AUDIO_CODEC_SHIFT_ADC_R_SILENCE_MONO_LEVEL_SEL 4
#define AUDIO_CODEC_MASK_ADC_R_SILENCE_MONO_LEVEL_SEL ((u32)0x00000007 << 4)                              /*!<R/W 1  adc_r_silence data detection threshold register control 3'b000: -78 db ; 3'b001: -84 db ; 3'b010: -90 db ; 3'b011: -102db 3'b100: -108db ; 3'b101: -114db ; 3'b110: -126db ; 3'b111: -132db */
#define AUDIO_CODEC_SHIFT_ADC_R_SILENCE_DET_MONO_EN  0
#define AUDIO_CODEC_BIT_ADC_R_SILENCE_DET_MONO_EN    ((u32)0x00000001 << 0)                              /*!<R/W 0  adc_r_silence data detection enable contorl 1'b0: diable adc_r_silence data detection 1'b1: enable adc_r_silence data detection */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_FAH
 * @brief  index_fah                                 (@ 0X1F4)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_DA_ZDET_TOUT         13
#define AUDIO_CODEC_MASK_DAC_L_DA_ZDET_TOUT          ((u32)0x00000003 << 13)                             /*!<R/W 0  mon DAC Lch Zero detection time out mode control 2'b00: 1024*16 samples 2'b01: 1024*32 samples 2'b10: 1024*64 samples 2'b11: 256 samples  */
#define AUDIO_CODEC_SHIFT_DAC_L_DA_ZDET_FUNC         11
#define AUDIO_CODEC_MASK_DAC_L_DA_ZDET_FUNC          ((u32)0x00000003 << 11)                             /*!<R/W 0x3  mon DAC Lch Zero detection function mode control 2'b00: Immediate change 2'b01: Zero detection and immediate change 2'b10: Zero detection and increase/decrease change 2'b11: N/A  */
#define AUDIO_CODEC_SHIFT_DAC_L_DA_DITHER_SEL        9
#define AUDIO_CODEC_MASK_DAC_L_DA_DITHER_SEL         ((u32)0x00000003 << 9)                              /*!<R/W 0x2  mon DAC Lch dither select 2'b00: disable 2'b01: LSB 2'b10: LSB+1 2'b11: LSB+2  */
#define AUDIO_CODEC_SHIFT_DAC_L_DAHPF_EN             8
#define AUDIO_CODEC_BIT_DAC_L_DAHPF_EN               ((u32)0x00000001 << 8)                              /*!<R/W 1  mon DAC Lch Narrow-band 1st HPF enable control 1'b0: Disable 1'b1: Enable  */
#define AUDIO_CODEC_SHIFT_DAC_L_DA_GAIN              0
#define AUDIO_CODEC_MASK_DAC_L_DA_GAIN               ((u32)0x000000FF << 0)                              /*!<R/W 0xFF  mon DAC Lch dvol gain control (0.375dB/step) 8'hAF: 0dB 8'h00: -65.625dB  */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_FBH
 * @brief  index_fbh                                 (@ 0X1F6)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_SDM_EF_EN            6
#define AUDIO_CODEC_BIT_DAC_L_SDM_EF_EN              ((u32)0x00000001 << 6)                              /*!<R/W 0  DAC Lch 2rd SDM enable 1'b0: off 1'b1: on */
#define AUDIO_CODEC_SHIFT_DAC_L_DMIX_MUTE_128FS_TONE_COMPENSATION 4
#define AUDIO_CODEC_BIT_DAC_L_DMIX_MUTE_128FS_TONE_COMPENSATION ((u32)0x00000001 << 4)                              /*!<R/W 1  mon DAC Lch 128fs-domain mixer a DC from dac_l_tone_compensation_offset 1'b0: off 1'b1: on */
#define AUDIO_CODEC_SHIFT_DAC_L_DMIX_MUTE_128FS_SIDETONE 3
#define AUDIO_CODEC_BIT_DAC_L_DMIX_MUTE_128FS_SIDETONE ((u32)0x00000001 << 3)                              /*!<R/W 1  mon DAC Lch 128fs-domain mixer sidetone path mute enable 1'b0: unmute 1'b1: mute  */
#define AUDIO_CODEC_SHIFT_DAC_L_DMIX_MUTE_128FS_DA   2
#define AUDIO_CODEC_BIT_DAC_L_DMIX_MUTE_128FS_DA     ((u32)0x00000001 << 2)                              /*!<R/W 0  mon DAC Lch 128fs-domain mixer da path mute enable 1'b0: unmute 1'b1: mute  */
#define AUDIO_CODEC_SHIFT_DAAD_LPBK_EN               1
#define AUDIO_CODEC_BIT_DAAD_LPBK_EN                 ((u32)0x00000001 << 1)                              /*!<R/W 0  Digital DAC & ADC loop back control 1'b0: Disable 1'b1: Enable  */
#define AUDIO_CODEC_SHIFT_DAC_L_DA_MUTE              0
#define AUDIO_CODEC_BIT_DAC_L_DA_MUTE                ((u32)0x00000001 << 0)                              /*!<R/W 0  mon DAC Lch dvol mute enable 1'b0: unmute 1'b1: mute  */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_FDH
 * @brief  index_fdh                                 (@ 0X1FA)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_ADDA_LPBK_EN               1
#define AUDIO_CODEC_BIT_ADDA_LPBK_EN                 ((u32)0x00000001 << 1)                              /*!<R/W 0  Digital ADC to DAC loop back control 1'b0: Disable 1'b1: Enable  */
/** @} */

/**************************************************************************//**
 * @defgroup AUDIO_CODEC_INDEX_FEH
 * @brief  index_feh                                 (@ 0X1FC)
 * @{
 *****************************************************************************/
#define AUDIO_CODEC_SHIFT_DAC_L_TONE_COMPENSATION_OFFSET0
#define AUDIO_CODEC_MASK_DAC_L_TONE_COMPENSATION_OFFSET ((u32)0x0000FFFF << 0)                              /*!<R/W 0  mon DAC Lch 128fs-domain mixe a DC compensation for spur issue 2's complemet */
/** @} */

