Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_audio_codec_type.h
/**************************************************************************//**
 * @defgroup rtl8735b_AUDIO_CODEC
 * @{
 * @brief rtl8735b_AUDIO_CODEC Register Declaration
 *****************************************************************************/
typedef struct {
	__IO uint32_t AUDIO_CODEC_INDEX_00H ;                  /*!<  index_00h register,  Address offset: 0x000 */
	__IO uint32_t AUDIO_CODEC_INDEX_01H ;                  /*!<  index_01h register,  Address offset: 0x002 */
	__IO uint32_t AUDIO_CODEC_INDEX_02H ;                  /*!<  index_02h register,  Address offset: 0x004 */
	__IO uint32_t AUDIO_CODEC_INDEX_03H ;                  /*!<  index_03h register,  Address offset: 0x006 */
	__IO uint32_t AUDIO_CODEC_INDEX_04H ;                  /*!<  index_04h register,  Address offset: 0x008 */
	__IO uint32_t AUDIO_CODEC_INDEX_05H ;                  /*!<  index_05h register,  Address offset: 0x00A */
	__IO uint32_t AUDIO_CODEC_INDEX_06H ;                  /*!<  index_06h register,  Address offset: 0x00C */
	__IO uint32_t AUDIO_CODEC_INDEX_07H ;                  /*!<  index_07h register,  Address offset: 0x00E */
	__IO uint32_t AUDIO_CODEC_INDEX_08H ;                  /*!<  index_08h register,  Address offset: 0x010 */
	__IO uint32_t AUDIO_CODEC_INDEX_09H ;                  /*!<  index_09h register,  Address offset: 0x012 */
	__I  uint32_t AUDIO_CODEC_INDEX_0AH ;                  /*!<  index_0ah register,  Address offset: 0x014 */
	__I  uint32_t AUDIO_CODEC_INDEX_0BH ;                  /*!<  index_0bh register,  Address offset: 0x016 */
	__IO uint32_t AUDIO_CODEC_INDEX_0CH ;                  /*!<  index_0ch register,  Address offset: 0x018 */
	__IO uint32_t AUDIO_CODEC_INDEX_0DH ;                  /*!<  index_0dh register,  Address offset: 0x01A */
	__IO uint32_t AUDIO_CODEC_INDEX_0EH ;                  /*!<  index_0eh register,  Address offset: 0x01C */
	__IO uint32_t AUDIO_CODEC_INDEX_0FH ;                  /*!<  index_0fh register,  Address offset: 0x01E */
	__IO uint32_t AUDIO_CODEC_INDEX_10H ;                  /*!<  index_10h register,  Address offset: 0x020 */
	__IO uint32_t AUDIO_CODEC_INDEX_11H ;                  /*!<  index_11h register,  Address offset: 0x022 */
	__IO uint32_t AUDIO_CODEC_INDEX_12H ;                  /*!<  index_12h register,  Address offset: 0x024 */
	__IO uint32_t AUDIO_CODEC_INDEX_13H ;                  /*!<  index_13h register,  Address offset: 0x026 */
	__IO uint32_t AUDIO_CODEC_INDEX_14H ;                  /*!<  index_14h register,  Address offset: 0x028 */
	__IO uint32_t AUDIO_CODEC_INDEX_15H ;                  /*!<  index_15h register,  Address offset: 0x02A */
	__IO uint32_t AUDIO_CODEC_INDEX_16H ;                  /*!<  index_16h register,  Address offset: 0x02C */
	__IO uint32_t AUDIO_CODEC_INDEX_17H ;                  /*!<  index_17h register,  Address offset: 0x02E */
	__IO uint32_t AUDIO_CODEC_INDEX_18H ;                  /*!<  index_18h register,  Address offset: 0x030 */
	__IO uint32_t AUDIO_CODEC_INDEX_19H ;                  /*!<  index_19h register,  Address offset: 0x032 */
	__IO uint32_t AUDIO_CODEC_INDEX_1AH ;                  /*!<  index_1ah register,  Address offset: 0x034 */
	__IO uint32_t AUDIO_CODEC_INDEX_1BH ;                  /*!<  index_1bh register,  Address offset: 0x036 */
	__I  uint32_t AUDIO_CODEC_INDEX_1CH ;                  /*!<  index_1ch register,  Address offset: 0x038 */
	__I  uint32_t AUDIO_CODEC_INDEX_1DH ;                  /*!<  index_1dh register,  Address offset: 0x03A */
	__I  uint32_t AUDIO_CODEC_INDEX_1EH ;                  /*!<  index_1eh register,  Address offset: 0x03C */
	__I  uint32_t AUDIO_CODEC_INDEX_1FH ;                  /*!<  index_1fh register,  Address offset: 0x03E */
	__I  uint32_t AUDIO_CODEC_INDEX_20H ;                  /*!<  index_20h register,  Address offset: 0x040 */
	__I  uint32_t AUDIO_CODEC_INDEX_21H ;                  /*!<  index_21h register,  Address offset: 0x042 */
	__I  uint32_t AUDIO_CODEC_INDEX_22H ;                  /*!<  index_22h register,  Address offset: 0x044 */
	__I  uint32_t AUDIO_CODEC_INDEX_23H ;                  /*!<  index_23h register,  Address offset: 0x046 */
	__I  uint32_t AUDIO_CODEC_INDEX_24H ;                  /*!<  index_24h register,  Address offset: 0x048 */
	__I  uint32_t AUDIO_CODEC_INDEX_25H ;                  /*!<  index_25h register,  Address offset: 0x04A */
	__I  uint32_t AUDIO_CODEC_INDEX_26H ;                  /*!<  index_26h register,  Address offset: 0x04C */
	__I  uint32_t AUDIO_CODEC_INDEX_27H ;                  /*!<  index_27h register,  Address offset: 0x04E */
	__I  uint32_t AUDIO_CODEC_INDEX_28H ;                  /*!<  index_28h register,  Address offset: 0x050 */
	__I  uint32_t AUDIO_CODEC_INDEX_29H ;                  /*!<  index_29h register,  Address offset: 0x052 */
	__I  uint32_t AUDIO_CODEC_INDEX_2AH ;                  /*!<  index_2ah register,  Address offset: 0x054 */
	__IO uint32_t AUDIO_CODEC_INDEX_2BH ;                  /*!<  index_2bh register,  Address offset: 0x056 */
	__IO uint32_t AUDIO_CODEC_INDEX_2CH ;                  /*!<  index_2ch register,  Address offset: 0x058 */
	__IO uint32_t AUDIO_CODEC_INDEX_2DH ;                  /*!<  index_2dh register,  Address offset: 0x05A */
	__IO uint32_t AUDIO_CODEC_INDEX_2EH ;                  /*!<  index_2eh register,  Address offset: 0x05C */
	__IO uint32_t AUDIO_CODEC_INDEX_2FH ;                  /*!<  index_2fh register,  Address offset: 0x05E */
	__IO uint32_t AUDIO_CODEC_INDEX_30H ;                  /*!<  index_30h register,  Address offset: 0x060 */
	__IO uint32_t AUDIO_CODEC_INDEX_31H ;                  /*!<  index_31h register,  Address offset: 0x062 */
	__IO uint32_t AUDIO_CODEC_INDEX_32H ;                  /*!<  index_32h register,  Address offset: 0x064 */
	__IO uint32_t AUDIO_CODEC_INDEX_33H ;                  /*!<  index_33h register,  Address offset: 0x066 */
	__IO uint32_t AUDIO_CODEC_INDEX_34H ;                  /*!<  index_34h register,  Address offset: 0x068 */
	__IO uint32_t AUDIO_CODEC_INDEX_35H ;                  /*!<  index_35h register,  Address offset: 0x06A */
	__IO uint32_t AUDIO_CODEC_INDEX_36H ;                  /*!<  index_36h register,  Address offset: 0x06C */
	__IO uint32_t AUDIO_CODEC_INDEX_37H ;                  /*!<  index_37h register,  Address offset: 0x06E */
	__IO uint32_t AUDIO_CODEC_INDEX_38H ;                  /*!<  index_38h register,  Address offset: 0x070 */
	__IO uint32_t AUDIO_CODEC_INDEX_39H ;                  /*!<  index_39h register,  Address offset: 0x072 */
	__IO uint32_t AUDIO_CODEC_INDEX_3AH ;                  /*!<  index_3ah register,  Address offset: 0x074 */
	__IO uint32_t AUDIO_CODEC_INDEX_3BH ;                  /*!<  index_3bh register,  Address offset: 0x076 */
	__IO uint32_t AUDIO_CODEC_INDEX_3CH ;                  /*!<  index_3ch register,  Address offset: 0x078 */
	__IO uint32_t AUDIO_CODEC_INDEX_3DH ;                  /*!<  index_3dh register,  Address offset: 0x07A */
	__IO uint32_t AUDIO_CODEC_INDEX_3EH ;                  /*!<  index_3eh register,  Address offset: 0x07C */
	__IO uint32_t AUDIO_CODEC_INDEX_3FH ;                  /*!<  index_3fh register,  Address offset: 0x07E */
	__IO uint32_t AUDIO_CODEC_INDEX_40H ;                  /*!<  index_40h register,  Address offset: 0x080 */
	__IO uint32_t AUDIO_CODEC_INDEX_41H ;                  /*!<  index_41h register,  Address offset: 0x082 */
	__IO uint32_t AUDIO_CODEC_INDEX_42H ;                  /*!<  index_42h register,  Address offset: 0x084 */
	__IO uint32_t AUDIO_CODEC_INDEX_43H ;                  /*!<  index_43h register,  Address offset: 0x086 */
	__IO uint32_t AUDIO_CODEC_INDEX_44H ;                  /*!<  index_44h register,  Address offset: 0x088 */
	__IO uint32_t AUDIO_CODEC_INDEX_45H ;                  /*!<  index_45h register,  Address offset: 0x08A */
	__IO uint32_t AUDIO_CODEC_INDEX_46H ;                  /*!<  index_46h register,  Address offset: 0x08C */
	__IO uint32_t AUDIO_CODEC_INDEX_47H ;                  /*!<  index_47h register,  Address offset: 0x08E */
	__IO uint32_t AUDIO_CODEC_INDEX_48H ;                  /*!<  index_48h register,  Address offset: 0x090 */
	__IO uint32_t AUDIO_CODEC_INDEX_49H ;                  /*!<  index_49h register,  Address offset: 0x092 */
	__IO uint32_t AUDIO_CODEC_INDEX_4AH ;                  /*!<  index_4ah register,  Address offset: 0x094 */
	__IO uint32_t AUDIO_CODEC_INDEX_4BH ;                  /*!<  index_4bh register,  Address offset: 0x096 */
	__IO uint32_t AUDIO_CODEC_INDEX_4CH ;                  /*!<  index_4ch register,  Address offset: 0x098 */
	__IO uint32_t AUDIO_CODEC_INDEX_4DH ;                  /*!<  index_4dh register,  Address offset: 0x09A */
	__IO uint32_t AUDIO_CODEC_INDEX_4EH ;                  /*!<  index_4eh register,  Address offset: 0x09C */
	__IO uint32_t AUDIO_CODEC_INDEX_4FH ;                  /*!<  index_4fh register,  Address offset: 0x09E */
	__IO uint32_t AUDIO_CODEC_INDEX_50H ;                  /*!<  index_50h register,  Address offset: 0x0A0 */
	__IO uint32_t AUDIO_CODEC_INDEX_51H ;                  /*!<  index_51h register,  Address offset: 0x0A2 */
	__IO uint32_t AUDIO_CODEC_INDEX_52H ;                  /*!<  index_52h register,  Address offset: 0x0A4 */
	__IO uint32_t AUDIO_CODEC_INDEX_53H ;                  /*!<  index_53h register,  Address offset: 0x0A6 */
	__IO uint32_t AUDIO_CODEC_INDEX_54H ;                  /*!<  index_54h register,  Address offset: 0x0A8 */
	__IO uint32_t AUDIO_CODEC_INDEX_55H ;                  /*!<  index_55h register,  Address offset: 0x0AA */
	__IO uint32_t AUDIO_CODEC_INDEX_56H ;                  /*!<  index_56h register,  Address offset: 0x0AC */
	__IO uint32_t AUDIO_CODEC_INDEX_57H ;                  /*!<  index_57h register,  Address offset: 0x0AE */
	__IO uint32_t AUDIO_CODEC_INDEX_58H ;                  /*!<  index_58h register,  Address offset: 0x0B0 */
	__IO uint32_t AUDIO_CODEC_INDEX_59H ;                  /*!<  index_59h register,  Address offset: 0x0B2 */
	__IO uint32_t AUDIO_CODEC_INDEX_5AH ;                  /*!<  index_5ah register,  Address offset: 0x0B4 */
	__IO uint32_t AUDIO_CODEC_INDEX_5BH ;                  /*!<  index_5bh register,  Address offset: 0x0B6 */
	__IO uint32_t AUDIO_CODEC_INDEX_5CH ;                  /*!<  index_5ch register,  Address offset: 0x0B8 */
	__I  uint32_t AUDIO_CODEC_INDEX_5DH ;                  /*!<  index_5dh register,  Address offset: 0x0BA */
	__I  uint32_t AUDIO_CODEC_INDEX_5EH ;                  /*!<  index_5eh register,  Address offset: 0x0BC */
	__I  uint32_t AUDIO_CODEC_INDEX_5FH ;                  /*!<  index_5fh register,  Address offset: 0x0BE */
	__I  uint32_t AUDIO_CODEC_INDEX_60H ;                  /*!<  index_60h register,  Address offset: 0x0C0 */
	__I  uint32_t AUDIO_CODEC_INDEX_61H ;                  /*!<  index_61h register,  Address offset: 0x0C2 */
	__I  uint32_t AUDIO_CODEC_INDEX_62H ;                  /*!<  index_62h register,  Address offset: 0x0C4 */
	__I  uint32_t AUDIO_CODEC_INDEX_63H ;                  /*!<  index_63h register,  Address offset: 0x0C6 */
	__I  uint32_t AUDIO_CODEC_INDEX_64H ;                  /*!<  index_64h register,  Address offset: 0x0C8 */
	__IO uint32_t AUDIO_CODEC_INDEX_65H ;                  /*!<  index_65h register,  Address offset: 0x0CA */
	__IO uint32_t AUDIO_CODEC_INDEX_66H ;                  /*!<  index_66h register,  Address offset: 0x0CC */
	__IO uint32_t AUDIO_CODEC_INDEX_67H ;                  /*!<  index_67h register,  Address offset: 0x0CE */
	__IO uint32_t AUDIO_CODEC_INDEX_68H ;                  /*!<  index_68h register,  Address offset: 0x0D0 */
	__IO uint32_t AUDIO_CODEC_INDEX_69H ;                  /*!<  index_69h register,  Address offset: 0x0D2 */
	__IO uint32_t AUDIO_CODEC_INDEX_6AH ;                  /*!<  index_6ah register,  Address offset: 0x0D4 */
	__IO uint32_t AUDIO_CODEC_INDEX_6BH ;                  /*!<  index_6bh register,  Address offset: 0x0D6 */
	__IO uint32_t AUDIO_CODEC_INDEX_6CH ;                  /*!<  index_6ch register,  Address offset: 0x0D8 */
	__IO uint32_t AUDIO_CODEC_INDEX_6DH ;                  /*!<  index_6dh register,  Address offset: 0x0DA */
	__IO uint32_t AUDIO_CODEC_INDEX_6EH ;                  /*!<  index_6eh register,  Address offset: 0x0DC */
	__IO uint32_t AUDIO_CODEC_INDEX_6FH ;                  /*!<  index_6fh register,  Address offset: 0x0DE */
	__IO uint32_t AUDIO_CODEC_INDEX_70H ;                  /*!<  index_70h register,  Address offset: 0x0E0 */
	__IO uint32_t AUDIO_CODEC_INDEX_71H ;                  /*!<  index_71h register,  Address offset: 0x0E2 */
	__IO uint32_t AUDIO_CODEC_INDEX_72H ;                  /*!<  index_72h register,  Address offset: 0x0E4 */
	__IO uint32_t AUDIO_CODEC_INDEX_73H ;                  /*!<  index_73h register,  Address offset: 0x0E6 */
	__IO uint32_t AUDIO_CODEC_INDEX_74H ;                  /*!<  index_74h register,  Address offset: 0x0E8 */
	__IO uint32_t AUDIO_CODEC_INDEX_75H ;                  /*!<  index_75h register,  Address offset: 0x0EA */
	__IO uint32_t AUDIO_CODEC_INDEX_76H ;                  /*!<  index_76h register,  Address offset: 0x0EC */
	__IO uint32_t AUDIO_CODEC_INDEX_77H ;                  /*!<  index_77h register,  Address offset: 0x0EE */
	__IO uint32_t AUDIO_CODEC_INDEX_78H ;                  /*!<  index_78h register,  Address offset: 0x0F0 */
	__IO uint32_t AUDIO_CODEC_INDEX_79H ;                  /*!<  index_79h register,  Address offset: 0x0F2 */
	__IO uint32_t AUDIO_CODEC_INDEX_7AH ;                  /*!<  index_7ah register,  Address offset: 0x0F4 */
	__IO uint32_t AUDIO_CODEC_INDEX_7BH ;                  /*!<  index_7bh register,  Address offset: 0x0F6 */
	__IO uint32_t AUDIO_CODEC_INDEX_7CH ;                  /*!<  index_7ch register,  Address offset: 0x0F8 */
	__IO uint32_t AUDIO_CODEC_INDEX_7DH ;                  /*!<  index_7dh register,  Address offset: 0x0FA */
	__IO uint32_t AUDIO_CODEC_INDEX_7EH ;                  /*!<  index_7eh register,  Address offset: 0x0FC */
	__IO uint32_t AUDIO_CODEC_INDEX_7FH ;                  /*!<  index_7fh register,  Address offset: 0x0FE */
	__IO uint32_t AUDIO_CODEC_INDEX_80H ;                  /*!<  index_80h register,  Address offset: 0x100 */
	__IO uint32_t AUDIO_CODEC_INDEX_81H ;                  /*!<  index_81h register,  Address offset: 0x102 */
	__IO uint32_t AUDIO_CODEC_INDEX_82H ;                  /*!<  index_82h register,  Address offset: 0x104 */
	__IO uint32_t AUDIO_CODEC_INDEX_83H ;                  /*!<  index_83h register,  Address offset: 0x106 */
	__IO uint32_t AUDIO_CODEC_INDEX_84H ;                  /*!<  index_84h register,  Address offset: 0x108 */
	__IO uint32_t AUDIO_CODEC_INDEX_85H ;                  /*!<  index_85h register,  Address offset: 0x10A */
	__IO uint32_t AUDIO_CODEC_INDEX_86H ;                  /*!<  index_86h register,  Address offset: 0x10C */
	__IO uint32_t AUDIO_CODEC_INDEX_87H ;                  /*!<  index_87h register,  Address offset: 0x10E */
	__IO uint32_t AUDIO_CODEC_INDEX_88H ;                  /*!<  index_88h register,  Address offset: 0x110 */
	__IO uint32_t AUDIO_CODEC_INDEX_89H ;                  /*!<  index_89h register,  Address offset: 0x112 */
	__IO uint32_t AUDIO_CODEC_INDEX_8AH ;                  /*!<  index_8ah register,  Address offset: 0x114 */
	__IO uint32_t AUDIO_CODEC_INDEX_8BH ;                  /*!<  index_8bh register,  Address offset: 0x116 */
	__IO uint32_t AUDIO_CODEC_INDEX_8CH ;                  /*!<  index_8ch register,  Address offset: 0x118 */
	__IO uint32_t AUDIO_CODEC_INDEX_8DH ;                  /*!<  index_8dh register,  Address offset: 0x11A */
	__IO uint32_t AUDIO_CODEC_INDEX_8EH ;                  /*!<  index_8eh register,  Address offset: 0x11C */
	__IO uint32_t AUDIO_CODEC_INDEX_8FH ;                  /*!<  index_8fh register,  Address offset: 0x11E */
	__IO uint32_t AUDIO_CODEC_INDEX_90H ;                  /*!<  index_90h register,  Address offset: 0x120 */
	__IO uint32_t AUDIO_CODEC_INDEX_91H ;                  /*!<  index_91h register,  Address offset: 0x122 */
	__IO uint32_t AUDIO_CODEC_INDEX_92H ;                  /*!<  index_92h register,  Address offset: 0x124 */
	__IO uint32_t AUDIO_CODEC_INDEX_93H ;                  /*!<  index_93h register,  Address offset: 0x126 */
	__IO uint32_t AUDIO_CODEC_INDEX_94H ;                  /*!<  index_94h register,  Address offset: 0x128 */
	__IO uint32_t AUDIO_CODEC_INDEX_95H ;                  /*!<  index_95h register,  Address offset: 0x12A */
	__IO uint32_t AUDIO_CODEC_INDEX_96H ;                  /*!<  index_96h register,  Address offset: 0x12C */
	__IO uint32_t AUDIO_CODEC_INDEX_97H ;                  /*!<  index_97h register,  Address offset: 0x12E */
	__IO uint32_t AUDIO_CODEC_INDEX_98H ;                  /*!<  index_98h register,  Address offset: 0x130 */
	__IO uint32_t AUDIO_CODEC_INDEX_99H ;                  /*!<  index_99h register,  Address offset: 0x132 */
	__IO uint32_t AUDIO_CODEC_INDEX_9AH ;                  /*!<  index_9ah register,  Address offset: 0x134 */
	__IO uint32_t AUDIO_CODEC_INDEX_9BH ;                  /*!<  index_9bh register,  Address offset: 0x136 */
	__IO uint32_t AUDIO_CODEC_INDEX_9CH ;                  /*!<  index_9ch register,  Address offset: 0x138 */
	__IO uint32_t AUDIO_CODEC_INDEX_9DH ;                  /*!<  index_9dh register,  Address offset: 0x13A */
	__IO uint32_t AUDIO_CODEC_INDEX_9EH ;                  /*!<  index_9eh register,  Address offset: 0x13C */
	__IO uint32_t AUDIO_CODEC_INDEX_9FH ;                  /*!<  index_9fh register,  Address offset: 0x13E */
	__IO uint32_t AUDIO_CODEC_INDEX_A0H ;                  /*!<  index_a0h register,  Address offset: 0x140 */
	__IO uint32_t AUDIO_CODEC_INDEX_A1H ;                  /*!<  index_a1h register,  Address offset: 0x142 */
	__IO uint32_t AUDIO_CODEC_INDEX_A2H ;                  /*!<  index_a2h register,  Address offset: 0x144 */
	__IO uint32_t AUDIO_CODEC_INDEX_A3H ;                  /*!<  index_a3h register,  Address offset: 0x146 */
	__IO uint32_t AUDIO_CODEC_INDEX_A4H ;                  /*!<  index_a4h register,  Address offset: 0x148 */
	__IO uint32_t AUDIO_CODEC_INDEX_A5H ;                  /*!<  index_a5h register,  Address offset: 0x14A */
	__IO uint32_t AUDIO_CODEC_INDEX_A6H ;                  /*!<  index_a6h register,  Address offset: 0x14C */
	__IO uint32_t AUDIO_CODEC_INDEX_A7H ;                  /*!<  index_a7h register,  Address offset: 0x14E */
	__IO uint32_t AUDIO_CODEC_INDEX_A8H ;                  /*!<  index_a8h register,  Address offset: 0x150 */
	__IO uint32_t AUDIO_CODEC_INDEX_A9H ;                  /*!<  index_a9h register,  Address offset: 0x152 */
	__IO uint32_t AUDIO_CODEC_INDEX_AAH ;                  /*!<  index_aah register,  Address offset: 0x154 */
	__IO uint32_t AUDIO_CODEC_INDEX_ABH ;                  /*!<  index_abh register,  Address offset: 0x156 */
	__IO uint32_t AUDIO_CODEC_INDEX_ACH ;                  /*!<  index_ach register,  Address offset: 0x158 */
	__IO uint32_t AUDIO_CODEC_INDEX_ADH ;                  /*!<  index_adh register,  Address offset: 0x15A */
	__IO uint32_t AUDIO_CODEC_INDEX_AEH ;                  /*!<  index_aeh register,  Address offset: 0x15C */
	__IO uint32_t AUDIO_CODEC_INDEX_AFH ;                  /*!<  index_afh register,  Address offset: 0x15E */
	__IO uint32_t AUDIO_CODEC_INDEX_B0H ;                  /*!<  index_b0h register,  Address offset: 0x160 */
	__IO uint32_t AUDIO_CODEC_INDEX_B1H ;                  /*!<  index_b1h register,  Address offset: 0x162 */
	__IO uint32_t AUDIO_CODEC_INDEX_B2H ;                  /*!<  index_b2h register,  Address offset: 0x164 */
	__IO uint32_t AUDIO_CODEC_INDEX_B3H ;                  /*!<  index_b3h register,  Address offset: 0x166 */
	__IO uint32_t AUDIO_CODEC_INDEX_B4H ;                  /*!<  index_b4h register,  Address offset: 0x168 */
	__IO uint32_t AUDIO_CODEC_INDEX_B5H ;                  /*!<  index_b5h register,  Address offset: 0x16A */
	__IO uint32_t AUDIO_CODEC_INDEX_B6H ;                  /*!<  index_b6h register,  Address offset: 0x16C */
	__IO uint32_t AUDIO_CODEC_INDEX_B7H ;                  /*!<  index_b7h register,  Address offset: 0x16E */
	__IO uint32_t AUDIO_CODEC_INDEX_B8H ;                  /*!<  index_b8h register,  Address offset: 0x170 */
	__IO uint32_t AUDIO_CODEC_INDEX_B9H ;                  /*!<  index_b9h register,  Address offset: 0x172 */
	__IO uint32_t AUDIO_CODEC_INDEX_BAH ;                  /*!<  index_bah register,  Address offset: 0x174 */
	__IO uint32_t AUDIO_CODEC_INDEX_BBH ;                  /*!<  index_bbh register,  Address offset: 0x176 */
	__IO uint32_t AUDIO_CODEC_INDEX_BCH ;                  /*!<  index_bch register,  Address offset: 0x178 */
	__IO uint32_t AUDIO_CODEC_INDEX_BDH ;                  /*!<  index_bdh register,  Address offset: 0x17A */
	__IO uint32_t AUDIO_CODEC_INDEX_BEH ;                  /*!<  index_beh register,  Address offset: 0x17C */
	__IO uint32_t AUDIO_CODEC_INDEX_BFH ;                  /*!<  index_bfh register,  Address offset: 0x17E */
	__IO uint32_t AUDIO_CODEC_INDEX_C0H ;                  /*!<  index_c0h register,  Address offset: 0x180 */
	__IO uint32_t AUDIO_CODEC_INDEX_C1H ;                  /*!<  index_c1h register,  Address offset: 0x182 */
	__IO uint32_t AUDIO_CODEC_INDEX_C2H ;                  /*!<  index_c2h register,  Address offset: 0x184 */
	__IO uint32_t AUDIO_CODEC_INDEX_C3H ;                  /*!<  index_c3h register,  Address offset: 0x186 */
	__IO uint32_t AUDIO_CODEC_INDEX_C4H ;                  /*!<  index_c4h register,  Address offset: 0x188 */
	__IO uint32_t AUDIO_CODEC_INDEX_C5H ;                  /*!<  index_c5h register,  Address offset: 0x18A */
	__IO uint32_t AUDIO_CODEC_INDEX_C6H ;                  /*!<  index_c6h register,  Address offset: 0x18C */
	__IO uint32_t AUDIO_CODEC_INDEX_C7H ;                  /*!<  index_c7h register,  Address offset: 0x18E */
	__IO uint32_t AUDIO_CODEC_INDEX_C8H ;                  /*!<  index_c8h register,  Address offset: 0x190 */
	__IO uint32_t AUDIO_CODEC_INDEX_C9H ;                  /*!<  index_c9h register,  Address offset: 0x192 */
	__IO uint32_t AUDIO_CODEC_INDEX_CAH ;                  /*!<  index_cah register,  Address offset: 0x194 */
	__IO uint32_t AUDIO_CODEC_INDEX_CBH ;                  /*!<  index_cbh register,  Address offset: 0x196 */
	__IO uint32_t AUDIO_CODEC_INDEX_CCH ;                  /*!<  index_cch register,  Address offset: 0x198 */
	__IO uint32_t AUDIO_CODEC_INDEX_CDH ;                  /*!<  index_cdh register,  Address offset: 0x19A */
	__IO uint32_t AUDIO_CODEC_INDEX_CEH ;                  /*!<  index_ceh register,  Address offset: 0x19C */
	__IO uint32_t AUDIO_CODEC_INDEX_CFH ;                  /*!<  index_cfh register,  Address offset: 0x19E */
	__IO uint32_t AUDIO_CODEC_INDEX_D0H ;                  /*!<  index_d0h register,  Address offset: 0x1A0 */
	__IO uint32_t AUDIO_CODEC_INDEX_D1H ;                  /*!<  index_d1h register,  Address offset: 0x1A2 */
	__IO uint32_t AUDIO_CODEC_INDEX_D2H ;                  /*!<  index_d2h register,  Address offset: 0x1A4 */
	__IO uint32_t AUDIO_CODEC_INDEX_D3H ;                  /*!<  index_d3h register,  Address offset: 0x1A6 */
	__IO uint32_t AUDIO_CODEC_INDEX_D4H ;                  /*!<  index_d4h register,  Address offset: 0x1A8 */
	__IO uint32_t AUDIO_CODEC_INDEX_D5H ;                  /*!<  index_d5h register,  Address offset: 0x1AA */
	__IO uint32_t AUDIO_CODEC_INDEX_D6H ;                  /*!<  index_d6h register,  Address offset: 0x1AC */
	__IO uint32_t AUDIO_CODEC_INDEX_D7H ;                  /*!<  index_d7h register,  Address offset: 0x1AE */
	__IO uint32_t AUDIO_CODEC_INDEX_D8H ;                  /*!<  index_d8h register,  Address offset: 0x1B0 */
	__IO uint32_t AUDIO_CODEC_INDEX_D9H ;                  /*!<  index_d9h register,  Address offset: 0x1B2 */
	__IO uint32_t AUDIO_CODEC_INDEX_DAH ;                  /*!<  index_dah register,  Address offset: 0x1B4 */
