Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_audio_codec_type.h
	__IO uint32_t AUDIO_CODEC_INDEX_DBH ;                  /*!<  index_dbh register,  Address offset: 0x1B6 */
	__IO uint32_t AUDIO_CODEC_INDEX_DCH ;                  /*!<  index_dch register,  Address offset: 0x1B8 */
	__IO uint32_t AUDIO_CODEC_INDEX_DDH ;                  /*!<  index_ddh register,  Address offset: 0x1BA */
	__IO uint32_t AUDIO_CODEC_INDEX_DEH ;                  /*!<  index_deh register,  Address offset: 0x1BC */
	__IO uint32_t AUDIO_CODEC_INDEX_DFH ;                  /*!<  index_dfh register,  Address offset: 0x1BE */
	__IO uint32_t AUDIO_CODEC_INDEX_E0H ;                  /*!<  index_e0h register,  Address offset: 0x1C0 */
	__IO uint32_t AUDIO_CODEC_INDEX_E1H ;                  /*!<  index_e1h register,  Address offset: 0x1C2 */
	__IO uint32_t AUDIO_CODEC_INDEX_E2H ;                  /*!<  index_e2h register,  Address offset: 0x1C4 */
	__IO uint32_t AUDIO_CODEC_INDEX_E3H ;                  /*!<  index_e3h register,  Address offset: 0x1C6 */
	__IO uint32_t AUDIO_CODEC_INDEX_E4H ;                  /*!<  index_e4h register,  Address offset: 0x1C8 */
	__IO uint32_t AUDIO_CODEC_INDEX_E5H ;                  /*!<  index_e5h register,  Address offset: 0x1CA */
	__IO uint32_t AUDIO_CODEC_INDEX_E6H ;                  /*!<  index_e6h register,  Address offset: 0x1CC */
	__IO uint32_t AUDIO_CODEC_INDEX_E7H ;                  /*!<  index_e7h register,  Address offset: 0x1CE */
	__IO uint32_t AUDIO_CODEC_INDEX_E8H ;                  /*!<  index_e8h register,  Address offset: 0x1D0 */
	__IO uint32_t AUDIO_CODEC_INDEX_E9H ;                  /*!<  index_E9h register,  Address offset: 0x1D2 */
	__IO uint32_t AUDIO_CODEC_INDEX_EAH ;                  /*!<  index_eah register,  Address offset: 0x1D4 */
	__IO uint32_t AUDIO_CODEC_INDEX_EBH ;                  /*!<  index_ebh register,  Address offset: 0x1D6 */
	__IO uint32_t AUDIO_CODEC_INDEX_ECH ;                  /*!<  index_ech register,  Address offset: 0x1D8 */
	__IO uint32_t AUDIO_CODEC_INDEX_EDH ;                  /*!<  index_edh register,  Address offset: 0x1DA */
	__IO uint32_t AUDIO_CODEC_INDEX_EEH ;                  /*!<  index_eeh register,  Address offset: 0x1DC */
	__IO uint32_t AUDIO_CODEC_INDEX_EFH ;                  /*!<  index_efh register,  Address offset: 0x1DE */
	__IO uint32_t AUDIO_CODEC_INDEX_F0H ;                  /*!<  index_f0h register,  Address offset: 0x1E0 */
	__IO uint32_t AUDIO_CODEC_INDEX_F1H ;                  /*!<  index_f1h register,  Address offset: 0x1E2 */
	__IO uint32_t AUDIO_CODEC_INDEX_F2H ;                  /*!<  index_f2h register,  Address offset: 0x1E4 */
	__IO uint32_t AUDIO_CODEC_INDEX_F3H ;                  /*!<  index_f3h register,  Address offset: 0x1E6 */
	__IO uint32_t AUDIO_CODEC_INDEX_F4H ;                  /*!<  index_f4h register,  Address offset: 0x1E8 */
	__IO uint32_t AUDIO_CODEC_INDEX_F5H ;                  /*!<  index_f5h register,  Address offset: 0x1EA */
	__IO uint32_t AUDIO_CODEC_INDEX_F6H ;                  /*!<  index_f6h register,  Address offset: 0x1EC */
	__IO uint32_t AUDIO_CODEC_INDEX_F7H ;                  /*!<  index_f7h register,  Address offset: 0x1EE */
	__IO uint32_t AUDIO_CODEC_INDEX_F8H ;                  /*!<  index_f8h register,  Address offset: 0x1F0 */
	__IO uint32_t AUDIO_CODEC_INDEX_F9H ;                  /*!<  index_f9h register,  Address offset: 0x1F2 */
	__IO uint32_t AUDIO_CODEC_INDEX_FAH ;                  /*!<  index_fah register,  Address offset: 0x1F4 */
	__IO uint32_t AUDIO_CODEC_INDEX_FBH ;                  /*!<  index_fbh register,  Address offset: 0x1F6 */
	__I  uint32_t AUDIO_CODEC_INDEX_FCH ;                  /*!<  index_fch register,  Address offset: 0x1F8 */
	__IO uint32_t AUDIO_CODEC_INDEX_FDH ;                  /*!<  index_fdh register,  Address offset: 0x1FA */
	__IO uint32_t AUDIO_CODEC_INDEX_FEH ;                  /*!<  index_feh register,			Address offset: 0x1FC */
} AUDIO_CODEC_TypeDef;
/** @} */

#endif
